[
  {
    "title": "Trump attends Steelers vs. Jets football game in Pittsburgh",
    "slug": "trump-attends-steelers-vs-jets-football-game-in-pittsburgh",
    "published_by": "From CNN's Kate Sullivan in Pittsburgh",
    "thumb": "",
    "metadata": "Donald Trump watches the first half of an NFL football game between the Pittsburgh Steelers and the New York Jets in Pittsburgh, on October 20.",
    "contents": [
      "Former President Donald Trump attended the Pittsburgh Steelers vs. New York Jets football game in Pittsburgh on Sunday.",
      "Trump sat in a box and at one point stood up and waved to the crowd. He was accompanied by Republican Sen. John Barrasso of Wyoming.",
      "The former president has previously attended football games in battleground states such as Pennsylvania, including a blockbuster Alabama-Georgia college game in Georgia last month.",
      "Playing quarterback for the Jets is Aaron Rodgers, an ally and one-time contender to be the running mate of Robert F. Kennedy Jr. The former independent candidate has since endorsed Trump for president."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2iecjxl003i3b6l44s1evsp\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20attends%20Steelers%20vs.%20Jets%20football%20game%20in%20Pittsburgh%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2iecjxl003i3b6l44s1evsp",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2iecjxl003i3b6l44s1evsp"
    },
    "completed": false
  },
  {
    "title": "Single largest donor of 2024 gives another $25 million to Trump group",
    "slug": "single-largest-donor-of-2024-gives-another-25-million-to-trump-group",
    "published_by": "From CNN's Fredreka Schouten",
    "thumb": "",
    "metadata": "",
    "contents": [
      "A super PAC supporting former President Donald Trump’s candidacy received another large donation from one of his biggest backers in September, new federal filings show.",
      "Timothy Mellon, a reclusive billionaire who is an heir to a banking fortune, contributed $25 million to Make America Great Again Inc., bringing his total donations to the Trump-aligned super PAC to a staggering $150 million this election cycle.",
      "Mellon’s September contribution accounted for more than 60% of the money the super PAC took in last month.",
      "Mellon, who also pumped millions into a super PAC that supported Robert F. Kennedy Jr.’s erstwhile independent bid for the White House, has emerged as the single largest disclosed donor of the 2024 election cycle."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ie14v400393b6l4wni8kw9\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Single%20largest%20donor%20of%202024%20gives%20another%20%2425%20million%20to%20Trump%20group\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ie14v400393b6l4wni8kw9",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2ie14v400393b6l4wni8kw9"
    },
    "completed": false
  },
  {
    "title": "North Carolina surpasses 1 million election ballots cast",
    "slug": "north-carolina-surpasses-1-million-election-ballots-cast",
    "published_by": "From CNN's Rashard Rose and Devon Sayers",
    "thumb": "",
    "metadata": "",
    "contents": [
      "North Carolina has surpassed 1 million election ballots cast, the State Board of Elections said Sunday.",
      "“As of 4 p.m. Sunday, the fourth day of in-person early voting in North Carolina, more than 1 million voters had cast ballots in the 2024 general election, according to preliminary State Board of Elections data,” the board said in a press release.",
      "Of the 1,008,123 ballots cast, over 900,00 were from early in-person voting, the elections board said.",
      "“The ballots cast number represents a statewide turnout of about 13% of North Carolina’s nearly 7.8 million registered voters,” the board said.",
      "“My sincerest thanks goes out to the county boards of elections and the thousands of election workers around the state who are making this happen,” Karen Brinson Bell, the state board’s executive director, said in a statement.",
      "Early voting in the key swing state began Thursday and runs until November 2."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ia9kb0002f3b6l550419ft\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ENorth%20Carolina%20surpasses%201%20million%20election%20ballots%20cast%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ia9kb0002f3b6l550419ft",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2ia9kb0002f3b6l550419ft"
    },
    "completed": false
  },
  {
    "title": "Walz says Trump looked \u0026#34;as dumb as I thought he would\u0026#34; during McDonald\u0026#39;s visit",
    "slug": "walz-says-trump-looked-34as-dumb-as-i-thought-he-would34-during-mcdonald39s-visit",
    "published_by": "From CNN's Aaron Pellish in Greenwich, Connecticut",
    "thumb": "",
    "metadata": "Tim Walz speaks to union members during a campaign stop in Saginaw, Michigan, on October 20.",
    "contents": [
      "Minnesota Gov. Tim Walz again chastised Donald Trump for his visit to a McDonald’s in Pennsylvania, saying the former president looked “as dumb as I thought he would” during the stop.",
      "The Democratic vice presidential nominee told supporters at a fundraiser in Greenwich, Connecticut, hosted by Gov. Ned Lamont that he feels he “trolled” Trump into visiting McDonald’s, where the former president worked the fry station and handed food to customers.",
      "Walz has repeatedly evoked the image of Trump potentially at a McDonald’s as an absurd and unlikely occurrence to contrast him with Vice President Harris, who worked at the fast-food chain in college.",
      "“I think I trolled him enough. He went today, and he looked as dumb as I thought he would. So I told my team, I’m going to say, ‘Can you imagine that guy skydiving?’ See if I can bait him into it,” he added."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hwqs8500053b6mz99vyvu7\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EWalz%20says%20Trump%20looked%20%22as%20dumb%20as%20I%20thought%20he%20would%22%20during%20McDonald's%20visit%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hwqs8500053b6mz99vyvu7",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hwqs8500053b6mz99vyvu7"
    },
    "completed": false
  },
  {
    "title": "Vance baselessly claims Harris \u0026#34;is the candidate of anti-Christian and anti-Catholic bigotry\u0026#34;",
    "slug": "vance-baselessly-claims-harris-34is-the-candidate-of-anti-christian-and-anti-catholic-bigotry34",
    "published_by": "From CNN's Kit Maher in Waukesha, Wisconsin",
    "thumb": "",
    "metadata": "Republican vice presidential nominee JD Vance speaks at a campaign event in Pittsburgh on October 17.",
    "contents": [
      "Republican vice presidential nominee JD Vance accused Vice President Kamala Harris of being “the candidate of anti-Christian and anti-Catholic bigotry” in remarks in Wisconsin on Sunday — the same day the vice president visited two churches.",
      "Vance’s comments came after Harris campaigned at two churches Sunday as part of a “souls to the polls” effort in Georgia, where she stressed the importance of voting and also spoke more personally about her faith.",
      "“For me, like for so many of us, church is then a place of growth and belonging and community; a place where we are reminded of the incredible power of faith and fellowship. And in moments of difficulty and uncertainty when the way is not clear, it is our faith that then guides us forward,” Harris said.",
      "Harris’ running mate, Minnesota Gov. Tim Walz, also attended a Sunday service in Michigan, where he said his and Harris’ Christian values have informed some of the policy platforms of the campaign, while drawing a “distinct difference” with actions and policies endorsed by Republicans.",
      "Harris serves alongside President Joe Biden, who is a lifelong Catholic and only the second Catholic president after John F. Kennedy."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i9x0l400213b6l37z4ly9u\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20baselessly%20claims%20Harris%20%22is%20the%20candidate%20of%20anti-Christian%20and%20anti-Catholic%20bigotry%22%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i9x0l400213b6l37z4ly9u",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i9x0l400213b6l37z4ly9u"
    },
    "completed": false
  },
  {
    "title": "Trump, 78, says he’s “not that close to 80” as he again touts cognitive tests",
    "slug": "trump-78-says-hes-not-that-close-to-80-as-he-again-touts-cognitive-tests",
    "published_by": "From CNN's Kate Sullivan in Harrisburg, Pennsylvania",
    "thumb": "",
    "metadata": "Former President Donald Trump takes the stage during a town hall event on October 20 in Lancaster, Pennsylvania.",
    "contents": [
      "Former President Donald Trump, 78, said at a town hall Sunday that he’s “not that close to 80” as he again touted cognitive tests he claims to have “aced.”",
      "“I have no cognitive — she may have a cognitive problem,” Trump said of Vice President Kamala Harris. “But there’s no cognitive problem.”",
      "“But I’d like to see cognitive tests for anybody running for president or vice president,” Trump said.",
      "Some background: The former president has previously expressed support for requiring mental competency tests for candidates. “I’m all for the tests,” Trump told NBC’s Kristen Welker last year, citing a cognitive test he took in 2020 at Walter Reed National Military Medical Center. “I aced it. I get everything right.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i6e98b001b3b6l1fhw5v7c\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%2C%2078%2C%20says%20he%E2%80%99s%20%E2%80%9Cnot%20that%20close%20to%2080%E2%80%9D%20as%20he%20again%20touts%20cognitive%20tests%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i6e98b001b3b6l1fhw5v7c",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i6e98b001b3b6l1fhw5v7c"
    },
    "completed": false
  },
  {
    "title": "Vance calls Cheney \u0026#34;resentful, petty, small person\u0026#34;; comments on Trump\u0026#39;s McDonald\u0026#39;s visit",
    "slug": "vance-calls-cheney-34resentful-petty-small-person34-comments-on-trump39s-mcdonald39s-visit",
    "published_by": "From CNN's Kit Maher in Waukesha, Wisconsin",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Republican vice presidential candidate JD Vance said he has a “low” opinion of Republican former Rep. Liz Cheney and claimed that she is motivated by “an obsessive hatred” toward those who contributed to her reelection loss in 2022, rather than by a love of country.",
      "“I’ve known a lot of people in Washington who’ve served with Liz Cheney, and what they would tell you to a person is that Liz Cheney is motivated by an obsessive hatred of the people who cost her Wyoming congressional seat. She is not motivated by a love of this country. She’s a resentful, petty, small person, and if Kamala Harris wants to parade her around, she’s welcome to,” Vance said in response to a reporter’s question in Waukesha.",
      "As he often does on the trail, Vance said former President Donald Trump is a symbol of the “big tent common sense team,” listing Robert F. Kennedy Jr., former Democratic Rep. Tulsi Gabbard, former South Carolina Gov. Nikki Haley and Georgia Gov. Brian Kemp as examples.",
      "Cheney, who has endorsed Harris, is campaigning with the vice president tomorrow in suburban counties of Pennsylvania, Wisconsin and Michigan.",
      "Vance also commented on Trump working as a fry attendant at McDonald’s earlier Sunday and suggested, as Trump has claimed, that Harris didn’t actually work there.",
      "“President Trump, he’s made it hard for Kamala Harris to run for president, but he made it a little bit harder, because I don’t know if you saw today, he went and worked at McDonald’s for about 15 minutes,” Vance said, as the crowd loudly cheered. “I caught him on the drive over here, and I said, ‘Sir, I think you’ve worked in McDonald’s about 15 minutes longer than Kamala Harris did.’”",
      "A campaign official told CNN that Harris worked at a McDonald’s in Alameda, California, during the summer of 1983, when she was still a student at Howard University in Washington. She worked the register and manned the fry and ice cream machines, according to the official."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i9oula001p3b6lofgz7n0t\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20calls%20Cheney%20%22resentful%2C%20petty%2C%20small%20person%22%3B%20comments%20on%20Trump's%20McDonald's%20visit%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i9oula001p3b6lofgz7n0t",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i9oula001p3b6lofgz7n0t"
    },
    "completed": false
  },
  {
    "title": "Walz criticizes Trump for sharing lewd Arnold Palmer anecdote",
    "slug": "walz-criticizes-trump-for-sharing-lewd-arnold-palmer-anecdote",
    "published_by": "From CNN's Aaron Pellish in Boston",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Minnesota Gov. Tim Walz chastised former President Donald Trump for making lewd comments about former pro golfer Arnold Palmer during a Pennsylvania rally on Saturday",
      "Walz referenced Trump’s anecdote, which lasted for over 15 minutes and included remarks about Palmer’s naked body, while talking to supporters at a Sunday campaign fundraiser in Boston.",
      "The Democratic vice presidential nominee criticized Trump’s comments while describing how some voters are just beginning to pay attention to the presidential election in the campaign’s final weeks.",
      "“For all of you folks … just tuning in, and there’s folks that hear him talking about everything from the ‘enemy from within,’ the dangerousness, to the insanity of talking about Arnold Palmer,” he said. “That’s this guy.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i5r93q00123b6l3hlqzoxu\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Walz%20criticizes%20Trump%20for%20sharing%20lewd%20Arnold%20Palmer%20anecdote\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i5r93q00123b6l3hlqzoxu",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i5r93q00123b6l3hlqzoxu"
    },
    "completed": false
  },
  {
    "title": "Harris reiterates that she needs to earn support of all voters",
    "slug": "harris-reiterates-that-she-needs-to-earn-support-of-all-voters",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Vice President Kamala Harris on Sunday reiterated she must earn the support of all supporters as she brushed off the notion that she is lagging in support among Black men when asked whether she believes resistance from some male voters is misogynistic.",
      "“I will also say this, Reverend: I am very clear, I must … earn the vote of everyone regardless of their race or gender,” Harris said during a taped interview with the Rev. Al Sharpton on MSNBC’s “PoliticsNation.”",
      "The vice president said it can be “frustrating” to be asked that question. “I think that’s actually an uninformed perspective because why would Black men be any different than any other demographic of voter? They expect that you earn their vote,” she said.",
      "Some background: Earlier this month, unveiled new proposals targeting Black men as she seeks to strengthen her coalition ahead of Election Day. The announcement came as Harris lags behind President Joe Biden’s numbers with Black voters in 2020, especially men, though recent polling suggests she has room to grow."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i5z2og00003b6ma7ryrbpx\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20reiterates%20that%20she%20needs%20to%20earn%20support%20of%20all%20voters%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i5z2og00003b6ma7ryrbpx",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i5z2og00003b6ma7ryrbpx"
    },
    "completed": false
  },
  {
    "title": "Elon Musk hosts town hall in Pittsburgh with Senate candidate McCormick",
    "slug": "elon-musk-hosts-town-hall-in-pittsburgh-with-senate-candidate-mccormick",
    "published_by": "From CNN's Rashard Rose",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Elon Musk attended a town hall event in Pittsburgh on Sunday as part of a series of events the tech billionaire is hosting throughout Pennsylvania in support of former President Donald Trump.",
      "Musk introduced GOP Pennsylvania Senate candidate Dave McCormick, who gave brief remarks urging those in the battleground state to vote.",
      "Musk also announced another million-dollar winner as part of his giveaway to registered voters, presenting the winner with a large check onstage.",
      "“As you may know, every day from now until the election, we’re giving out a million-dollar prize, and all you have to do is sign a petition in support of the Constitution. It’s very straight forward. You don’t even have to vote,” he said.",
      "The measure has immediately drawn scrutiny from election law experts, who said the sweepstakes could violate laws against paying people to register."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i2hu3a000u3b6l6w5obvw4\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EElon%20Musk%20hosts%20town%20hall%20in%20Pittsburgh%20with%20Senate%20candidate%20McCormick%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i2hu3a000u3b6l6w5obvw4",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i2hu3a000u3b6l6w5obvw4"
    },
    "completed": false
  },
  {
    "title": "Elon Musk’s daily $1 million giveaway to registered voters could be illegal, experts say",
    "slug": "elon-musks-daily-1-million-giveaway-to-registered-voters-could-be-illegal-experts-say",
    "published_by": "From CNN's Marshall Cohen",
    "thumb": "",
    "metadata": "Elon Musk participates in an event to promote early and absentee voting on October 17 in Folsom, Pennsylvania.",
    "contents": [
      "While stumping for former President Donald Trump on Saturday, tech billionaire Elon Musk announced that he will give away $1 million each day to registered voters in battleground states, immediately drawing scrutiny from election law experts who said the sweepstakes could violate laws against paying people to register.",
      "The X owner and Tesla CEO was referring to a petition launched by his political action committee affirming support for the rights to free speech and to bear arms. Musk, the richest man in the world, has given more than $75 million to his pro-Trump super PAC, and said he hopes the sweepstakes will boost registration among Trump voters.",
      "Some context: Federal law makes it a crime for anyone who “pays or offers to pay or accepts payment either for registration to vote or for voting.” It’s punishable by up to five years in prison.",
      "“When you start limiting prizes or giveaways to only registered voters or only people who have voted, that’s where bribery concerns arise,” said Derek Muller, an election law expert who teaches at Notre Dame Law School.",
      "Read more about Musk’s sweepstakes here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i0cwud00053b6mk58d272w\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EElon%20Musk%E2%80%99s%20daily%20%241%20million%20giveaway%20to%20registered%20voters%20could%20be%20illegal%2C%20experts%20say%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i0cwud00053b6mk58d272w",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i0cwud00053b6mk58d272w"
    },
    "completed": false
  },
  {
    "title": "Harris says Hamas leader\u0026#39;s death “removed an obstacle” from Middle East conflict",
    "slug": "harris-says-hamas-leader39s-death-removed-an-obstacle-from-middle-east-conflict",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Vice President Kamala Harris on Sunday said the death of Hamas leader Yahya Sinwar “removed an obstacle” to bringing an end to the Israel-Hamas war when asked how she would move toward a ceasefire if elected president.",
      "“So, first of all — look, it’s going to be hard, it’s going to be difficult, but we have got to get this war over with. We got to get the hostages out. We need the war to end,” Harris said during a taped interview on MSNBC’s “PoliticsNation” with the Rev. Al Sharpton.",
      "“And the death of Sinwar I believe has removed an obstacle to that end. And so, we’ve got to work at it and we’ve got to work at it through diplomatic means and that’s what we intend to do,” Harris said.",
      "Earlier this week, Israel succeeded in its yearlong mission to kill Sinwar, the man accused of being one of the masterminds of the October 7 attacks.",
      "Harris noted US Secretary of State Antony Blinken would travel to the region soon and again condemned the killing of innocent civilians as she reiterated her unwavering support for Israel.",
      "“Listen the number of innocent Palestinians that have been killed in Gaza, it’s really unconscionable and we have to be honest about that…” Harris said, adding, “I will always stand in terms of Israel’s right to defend itself, and we need this war to end.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i3w97f00003b6mv5zf8ffr\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20says%20Hamas%20leader's%20death%20%E2%80%9Cremoved%20an%20obstacle%E2%80%9D%20from%20Middle%20East%20conflict%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i3w97f00003b6mv5zf8ffr",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i3w97f00003b6mv5zf8ffr"
    },
    "completed": false
  },
  {
    "title": "Walz calls out Trump after former president\u0026#39;s McDonald\u0026#39;s visit",
    "slug": "walz-calls-out-trump-after-former-president39s-mcdonald39s-visit",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Minnesota Gov. Tim Walz reacted to former President Donald Trump working at a McDonald’s in Pennsylvania on Sunday by contrasting Vice President Kamala Harris’ support for workers with Trump’s history of “stiffing” them.",
      "Walz, in a social media post, touted Harris’ experience working at McDonald’s while in college and called out Trump for opposing minimum wage increases and cutting overtime benefits for workers as president.",
      "Harris has said she worked at McDonald’s as a young woman, and the detail has become a centerpiece of the middle-class origin story she has made key to her pitch to voters. Trump, meanwhile, has grown fixated on Harris’ employment there, regularly accusing the vice president — without evidence — of making up the factoid."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hyuzkr000m3b6l5ftnc3mx\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EWalz%20calls%20out%20Trump%20after%20former%20president's%20McDonald's%20visit%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hyuzkr000m3b6l5ftnc3mx",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hyuzkr000m3b6l5ftnc3mx"
    },
    "completed": false
  },
  {
    "title": "Harris urges Black voters to head to the polls during second church visit in Georgia",
    "slug": "harris-urges-black-voters-to-head-to-the-polls-during-second-church-visit-in-georgia",
    "published_by": "From CNN's Ebony Davis in Jonesboro, Georgia",
    "thumb": "",
    "metadata": "Vice President Kamala Harris speaks during a church service and early vote event at Divine Faith Ministries International on October 20, in Jonesboro, Ga.",
    "contents": [
      "Vice President Kamala Harris on Sunday continued to encourage early voting among Black voters during her second church visit of the day in battleground Georgia.",
      "“This work is so important, because in these next 16 days, with your help, I hope that we will continue to work on building back up community. The church knows best how to do that,” she added.",
      "The visit was part of the Harris campaign’s “souls to the polls” push to turn out Black voters and encourage early voting.",
      "To mark Harris’ 60th birthday, legendary singer Stevie Wonder and the congregants sang “Happy Birthday” to the vice president.",
      "“My final point is to thank the great Stevie Wonder, because … if one were to ever have a life dream, you know, people talk about a bucket list — I think I have just checked off a whole big one to have Stevie Wonder himself sing me ‘Happy Birthday,’” she said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i12o7b000g3b6mktg2fo3a\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20urges%20Black%20voters%20to%20head%20to%20the%20polls%20during%20second%20church%20visit%20in%20Georgia%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2i12o7b000g3b6mktg2fo3a",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2i12o7b000g3b6mktg2fo3a"
    },
    "completed": false
  },
  {
    "title": "Harris argues Trump “demeans the office” of the presidency in response to his latest insult",
    "slug": "harris-argues-trump-demeans-the-office-of-the-presidency-in-response-to-his-latest-insult",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "",
    "metadata": "Vice President Kamala Harris speaks at a campaign event at Divine Faith Ministries International on October 20, in Jonesboro, Georgia.",
    "contents": [
      "Vice President Kamala Harris on Sunday argued Donald Trump “demeans the office” of the presidency in response to the latest insult he made about her.",
      "During a rally in Latrobe, Pennsylvania, on Saturday, Trump called Harris a “sh*t vice president” as he ramps up attacks on his Democratic presidential rival in the final stretch of the campaign.",
      "Harris again reiterated Trump “should never again stand behind the seal of the president of the United States.”",
      "“He has not earned the right, and that is why he is going to lose,” she said.",
      "Harris’ full interview with the Rev. Al Sharpton on will air on MSNBC’s “PolticsNations” at 5 p.m. ET."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hzqico00003b6m37b5w3b1\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20argues%20Trump%20%E2%80%9Cdemeans%20the%20office%E2%80%9D%20of%20the%20presidency%20in%20response%20to%20his%20latest%20insult%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hzqico00003b6m37b5w3b1",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hzqico00003b6m37b5w3b1"
    },
    "completed": false
  },
  {
    "title": "Trump wishes Harris a happy birthday during his stop at McDonald’s",
    "slug": "trump-wishes-harris-a-happy-birthday-during-his-stop-at-mcdonalds",
    "published_by": "From CNN's Kate Sullivan in Feasterville-Trevose, Pennsylvania",
    "thumb": "",
    "metadata": "Former President Donald Trump answers questions as he works the drive-thru line at a McDonald's restaurant on October 20, in Feasterville-Trevose, Pennsylvania.",
    "contents": [
      "Former President Donald Trump on Sunday wished Vice President Kamala Harris a happy birthday and joked that he would get her some McDonald’s french fries.",
      "“It’s Kamala’s birthday? She’s 60 years old? Yes, I would say happy birthday, Kamala,” Trump said when asked by a reporter whether he wanted to say anything to the vice president on her birthday.",
      "“I think I’ll get her some flowers. Maybe I’ll get her some fries. … I’ll get her a McDonald’s hamburger,” Trump joked after receiving a tutorial on how to work the french fry station at the restaurant.",
      "Trump’s visit to the fast-food chain comes as has his fixation has grown around Harris’ past employment there, and the stop marked his latest attempt to sow doubt about the Democrat’s work history."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hxpvm700053b6l7aaautm1\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20wishes%20Harris%20a%20happy%20birthday%20during%20his%20stop%20at%20McDonald%E2%80%99s%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hxpvm700053b6l7aaautm1",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hxpvm700053b6l7aaautm1"
    },
    "completed": false
  },
  {
    "title": "Emhoff and Walz wish Harris a happy 60th birthday",
    "slug": "emhoff-and-walz-wish-harris-a-happy60th-birthday",
    "published_by": "From CNN's Aaron Pellish and Alison Main",
    "thumb": "",
    "metadata": "Second gentleman Doug Emhoff hugs Vice President Kamala Harris at the Democratic National Convention in Chicago on August 22.",
    "contents": [
      "Second gentleman Doug Emhoff and Minnesota Gov. Tim Walz wished Vice President Kamala Harris a happy 60th birthday Sunday.",
      "Emhoff, Harris’ husband, posted a video to his official White House account on X featuring photos of him and Harris and a brief message describing his role in their relationship.",
      "In a message posted with the video, Emhoff wrote, “Happy birthday, honey. I love you so much, and I’ll always have your back.”",
      "Emhoff said he plans to celebrate with Harris this evening after they both spend the day on the campaign trail. He said “if everything works out,” he’ll meet Harris, who spent the morning in Georgia mobilizing Black voters, in Philadelphia this evening, so the couple can “actually see each other for the first time in a week.”",
      "Walz, Harris’ running mate, wrote in a social media post Sunday: “Happy Birthday, @KamalaHarris! Thank you for bringing compassion, decency, and joy to our politics. I’m honored to be in this fight with you, and I couldn’t be prouder to call you my friend.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hxbxq000003b6ljkbmdyd8\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EEmhoff%20and%20Walz%20wish%20Harris%20a%20happy%C2%A060th%20birthday%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hxbxq000003b6ljkbmdyd8",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hxbxq000003b6ljkbmdyd8"
    },
    "completed": false
  },
  {
    "title": "Trump works fry cooker and drive-thru window at McDonald\u0026#39;s in Pennsylvania",
    "slug": "trump-works-fry-cooker-and-drive-thru-window-at-mcdonald39s-in-pennsylvania",
    "published_by": "From CNN's Kate Sullivan in Feasterville-Trevose, Pennyslvnaia",
    "thumb": "",
    "metadata": "Former President Donald Trump works behind the counter during a visit to McDonald's in Feasterville-Trevose, Pennsylvania, on Sunday, October 20.Trump works the drive-thru window.",
    "contents": [
      "Former President Donald Trump swapped his suit jacket for an apron to work the fry cooker and drive-thru window at a McDonald’s in Pennsylvania on Sunday afternoon.",
      "Trump’s visit to the fast-food chain comes as has his fixation has grown around Vice President Kamala Harris’ past employment there, and his visit to the restaurant marked his latest attempt to sow doubt about the Democrat’s work history.",
      "Trump received a tutorial on how to work the fry station and then tried his hand at cooking the fries in oil and scooping them into the packaging. Trump then stood at the drive-thru window and handed customers bags of food.",
      "“This is fun, I could do this all day. I wouldn’t mind this job,” Trump said.",
      "Some background: A Harris campaign official previously told CNN that she worked at a McDonald’s in Alameda, California, during the summer of 1983 when she was a college student at Howard University in Washington, DC. She worked the register and manned the fry and ice cream machines, according to the official.",
      "This post has been updated with additional information."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hwetwo00003b6mn0brjf3b\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Trump%20works%20fry%20cooker%20and%20drive-thru%20window%20at%20McDonald's%20in%20Pennsylvania\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hwetwo00003b6mn0brjf3b",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hwetwo00003b6mn0brjf3b"
    },
    "completed": false
  },
  {
    "title": "Emhoff tells Michigan Jewish voters that it\u0026#39;s \u0026#34;so vexing to me that any Jew supports\u0026#34; Trump",
    "slug": "emhoff-tells-michigan-jewish-voters-that-it39s-34so-vexing-to-me-that-any-jew-supports34-trump",
    "published_by": "From CNN's Ali Main in Southfield, Michigan",
    "thumb": "",
    "metadata": "Second Gentleman Doug Emhoff speaks to Jewish voters during a rally for Vice President Kamala Harris in Southfield, Michigan, on Sunday, October 20.",
    "contents": [
      "Second gentleman Doug Emhoff questioned why Jewish voters would support Donald Trump, highlighting antisemitic comments made by the former president, who has repeatedly said Jewish Americans who vote for Democrats should have their “head examined.”",
      "“It’s so vexing to me that any Jew supports him,” Emhoff, Vice President Kamala Harris’ husband, told Jewish voters at a Democratic campaign office in Southfield, Michigan.",
      "Trump said at an event in Washington, DC, last month that “the Jewish people” would be partially to blame if he loses in November, insisting that Democrats hold a “curse” over them. He has also repeatedly played into an antisemitic trope that Jewish Americans have dual loyalties to the US and to Israel.",
      "Emhoff, who has used his platform as second gentleman to focus on fighting antisemitism in the US, also referenced how Trump had called him a “crappy Jew” in a radio interview this year. He said that if Harris is elected, she would continue to encourage him to fight antisemitism as first gentleman."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hvq7me00843b6mgqxodjvs\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EEmhoff%20tells%20Michigan%20Jewish%20voters%20that%20it's%20%22so%20vexing%20to%20me%20that%20any%20Jew%20supports%22%20Trump%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hvq7me00843b6mgqxodjvs",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hvq7me00843b6mgqxodjvs"
    },
    "completed": false
  },
  {
    "title": "Trump criticizes White House policy on Israel and praises Netanyahu following call",
    "slug": "trump-criticizes-white-house-policy-on-israel-and-praises-netanyahu-following-call",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Former President Donald Trump on Sunday said Israel “wouldn’t be in the good position they’re in right now if they listened to the White House,” and congratulated Israeli Prime Minister Benjamin Netanyahu when the two spoke by phone yesterday for “doing a very great job keeping Israel safe.”",
      "The White House’s relationship with Netanyahu has grown increasingly frosty as the humanitarian crisis in Gaza has worsened and Netanyahu has made unilateral steps in the region without consulting the administration.",
      "Trump told reporters in Philadelphia that he also spoke with Netanyahu about the drones launched toward the Israeli prime minister’s home.",
      "In response to a question from CNN about the call, Trump said, “I had a very nice call with him. He called me up yesterday morning we talked. I congratulated him on obviously doing a very great job keeping Israel safe. He’s doing very well. He calls me on occasion. I think he wants my views on things.”",
      "“But we had a very good talk. It lasted for a while,” Trump said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hvgz69007v3b6ma7fbtonx\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20criticizes%20White%20House%20policy%20on%20Israel%20and%20praises%20Netanyahu%20following%20call%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hvgz69007v3b6ma7fbtonx",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hvgz69007v3b6ma7fbtonx"
    },
    "completed": false
  },
  {
    "title": "Trump expects Nikki Haley to join him on campaign trail",
    "slug": "trump-expects-nikki-haley-to-join-him-on-campaign-trail",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "",
    "metadata": "Nikki Haley speaks at the Hudson Institute on May 22, in Washington, DC.",
    "contents": [
      "Former President Donald Trump said Sunday he expects his former GOP presidential opponent Nikki Haley to hit the campaign trail with him in the final stretch before Election Day.",
      "“I think she is going to be,” Trump said when asked by a reporter if he wanted to see Haley on the campaign trail with him.",
      "CNN has reported that Trump’s campaign is in talks with Haley to join him on the trail as he seeks to broaden his appeal among female voters, two sources familiar with the talks told CNN."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2huvs2q007b3b6mkz0946vu\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20expects%20Nikki%20Haley%20to%20join%20him%20on%20campaign%20trail%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2huvs2q007b3b6mkz0946vu",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2huvs2q007b3b6mkz0946vu"
    },
    "completed": false
  },
  {
    "title": "Trump says Harris should be investigated over \u0026#34;60 Minutes\u0026#34; interview, says he\u0026#39;s going to subpoena CBS",
    "slug": "trump-says-harris-should-be-investigated-over-3460-minutes34-interview-says-he39s-going-to-subpoena-cbs",
    "published_by": "From CNN's Veronica Stracqualursi",
    "thumb": "",
    "metadata": "Former President Donald Trump speaks with reporters at Philadelphia International Airport on October 20.",
    "contents": [
      "Former President Donald Trump suggested that his opponent Vice President Kamala Harris should be investigated over her “60 Minutes” interview, which he claims was grossly edited by CBS at the direction of the Harris campaign.",
      "He suggested that he’s planning to “subpoena” CBS’ “records” to “see how much else did she do.”",
      "“60 Minutes” in a response Sunday rejected the former president’s claims and noted that Trump backed out of his interview with the show earlier this month.",
      "“Former President Donald Trump is accusing 60 Minutes of deceitful editing of our Oct. 7 interview with Vice President Kamala Harris. That is false,” the CBS show said in a statement.",
      "“60 Minutes gave an excerpt of our interview to Face the Nation that used a longer section of her answer than that on 60 Minutes,” the statement reads. “Same question. Same answer. But a different portion of the response. When we edit any interview, whether a politician, an athlete, or movie star, we strive to be clear, accurate and on point. The portion of her answer on 60 Minutes was more succinct, which allows time for other subjects in a wide ranging 21-minute-long segment.”",
      "Trump also repeated his false claims about Haitian migrants in Springfield, Ohio. When Kurtz pointed out that his claims have been debunked by local officials, Trump said, “I don’t think it’s been debunked at all. I think nobody talks about it, except you.”",
      "Trump stood by his comments that January 6, 2021, was a “day of love,” and insisted that “there was a beauty and love to it that I’ve never seen before” at the rally. He also falsely claimed that law enforcement was “ushering” protesters into the US Capitol that day.",
      "This post has been updated with comment from “60 Minutes.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2htozm9005y3b6m75xwx5bc\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20says%20Harris%20should%20be%20investigated%20over%20%2260%20Minutes%22%20interview%2C%20says%20he's%20going%20to%20subpoena%20CBS%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2htozm9005y3b6m75xwx5bc",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2htozm9005y3b6m75xwx5bc"
    },
    "completed": false
  },
  {
    "title": "Walz highlights his faith and health inequities in the Black community at church service",
    "slug": "walz-highlights-his-faith-and-health-inequities-in-the-black-community-at-church-service",
    "published_by": "From CNN's Aaron Pellish in Saginaw, Michigan",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Minnesota Gov. Tim Walz sought to contrast his and Vice President Kamala Harris’ roots in the religious community with that of former President Donald Trump during remarks at a predominantly Black church congregation in Saginaw, Michigan, on Sunday.",
      "At the service at Victorious Believers Ministries, Walz said his and Harris’ Christian values have informed some of the policy platforms of the campaign, while drawing a “distinct difference” with actions and policies endorsed by Republicans.",
      "“My faith is very clear. My faith tells me to care for the poor, not to rig the system for the wealthy, but to care for the poor,” he said.",
      "Walz also acknowledged “systemic barriers” that contribute to Black Americans having lower life expectancies, more challenges getting credit and less funding for education programs, and said Harris’ proposals will “provide the opportunities to make sure it ends.”",
      "“I think for all of you, this idea of really focusing, and certainly in the Black community, focusing on the things that matter, health,” Walz said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hugtdd006w3b6m64vv4ccj\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EWalz%20highlights%20his%20faith%20and%20health%20inequities%20in%20the%20Black%20community%20at%20church%20service%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hugtdd006w3b6m64vv4ccj",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hugtdd006w3b6m64vv4ccj"
    },
    "completed": false
  },
  {
    "title": "Vance encourages people to vote early at Packers\u0026#39; tailgate",
    "slug": "vance-encourages-people-to-vote-early-at-packers39-tailgate",
    "published_by": "From CNN's Kit Maher in Green Bay, Wisconsin",
    "thumb": "",
    "metadata": "Sen. JD Vance serves beers at a sports bar in Green Bay, Wisconsin, on October 20.",
    "contents": [
      "Republican vice presidential candidate JD Vance swung by a Packers tailgate in Green Bay as he campaigns in Wisconsin, encouraging people to vote early and by mail in the final push to Election Day.",
      "Vance continued, “If you can vote early, vote early. If you get your friends to vote early, vote early, vote by mail, do everything that we can.”",
      "Earlier in the day, Vance made an unannounced stop at Kroll’s West sports bar in Green Bay, Wisconsin, serving beers ahead of the Packers’ game.",
      "Sporting a Trump-Vance half-zip, Vance was greeted by loud cheers and chants of “J-D.”",
      "“What percentage of the fans today are going to vote for Donald Trump?” Vance said as the bar cheered.",
      "“That’s good,” Vance said. “I don’t know what the exact answer is, but it’s good.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hsbxec00453b6mu63jyock\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20encourages%20people%20to%20vote%20early%20at%20Packers'%20tailgate%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hsbxec00453b6mu63jyock",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hsbxec00453b6mu63jyock"
    },
    "completed": false
  },
  {
    "title": "Michigan secretary of state condemns \u0026#34;adversaries of democracy\u0026#34; spreading election security rumors",
    "slug": "michigan-secretary-of-state-condemns-34adversaries-of-democracy34-spreading-election-security-rumors",
    "published_by": "From CNN’s Mina Allen",
    "thumb": "",
    "metadata": "Michigan Secretary of State Jocelyn Benson speaks during a House Administration Committee hearing on September 11, in Washington, DC.",
    "contents": [
      "Michigan Secretary of State Jocelyn Benson on Sunday condemned “adversaries of democracy” that she said were spreading false rumors about the security of the election.",
      "Benson has been vocal on X, formerly Twitter, warning voters about Elon Musk - who she argues is intentionally spreading false information about Michigan voters. She encouraged voters to direct questions to election officials and to look through data rather than default to social media.",
      "More than one million Michigan voters have returned their absentee ballots in just over two weeks, according to Benson. Benson said the turnout shows how enthusiastic voters are this election cycle.",
      "In 2020, Benson said Michigan had its election results within 24 hours of the polls closing and expects the results to possibly come out by Wednesday night or earlier this year."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hti52q005p3b6mgxlbt3oc\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EMichigan%20secretary%20of%20state%20condemns%20%22adversaries%20of%20democracy%22%20spreading%20election%20security%20rumors%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hti52q005p3b6mgxlbt3oc",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hti52q005p3b6mgxlbt3oc"
    },
    "completed": false
  },
  {
    "title": "Rep. Lawler criticizes inflammatory rhetoric on the campaign trail as he faces his own tight race",
    "slug": "rep-lawler-criticizes-inflammatory-rhetoric-on-the-campaign-trail-as-he-faces-his-own-tight-race",
    "published_by": "From CNN's Sarah Davis",
    "thumb": "",
    "metadata": "Rep. Mike Lawler speaks during a press conference in Washington, DC, on May 23.",
    "contents": [
      "New York Rep. Mike Lawler urged political unity during a time of heightened party polarization and inflammatory rhetoric on the campaign trail, saying “all of the rhetoric needs to stop.”",
      "Both Vice President Kamala Harris and ex-President Donald Trump have weaponized strong wording to criticize their political opponents on the trail. Harris agreed that Trump is “about fascism” in a recent podcast interview, and Trump called Democrats the “enemy from within.”",
      "The Republican congressman said on CBS’ “Face the Nation” that political division distracts from the “threats that are actually facing the United States” from countries like China, Russia and Iran.",
      "Lawler is in a tight reelection race against former Democratic Rep. Modaire Jones in his Hudson Valley district as Republicans try to maintain their slim majority in the House."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ht8fpu005d3b6mlpjtbbbk\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ERep.%20Lawler%20criticizes%20inflammatory%20rhetoric%20on%20the%20campaign%20trail%20as%20he%20faces%20his%20own%20tight%20race%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2ht8fpu005d3b6mlpjtbbbk",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2ht8fpu005d3b6mlpjtbbbk"
    },
    "completed": false
  },
  {
    "title": "Trump reiterates \u0026#34;enemy from within\u0026#34; comments, calls Schiff and Pelosi the \u0026#34;enemy\u0026#34;",
    "slug": "trump-reiterates-34enemy-from-within34-comments-calls-schiff-and-pelosi-the-34enemy34",
    "published_by": "From CNN's Veronica Stracqualursi",
    "thumb": "",
    "metadata": "Former President Donald Trump arrives on stage at a campaign rally in Detroit on October 18.",
    "contents": [
      "Former President Donald Trump on Sunday repeated his “enemy from within” remarks, referring to California Democratic Reps. Adam Schiff and Nancy Pelosi as the “enemy.”",
      "“Well, of course, he’s an enemy. He’s an enemy,” Trump said Sunday of Schiff in an interview on Fox News’ “MediaBuzz.”",
      "In a previous interview with Fox News’ Maria Bartiromo, Trump had suggested using the military to handle what he called “the enemy from within” on Election Day, saying that he isn’t worried about chaos from his supporters or foreign actors, but instead from “radical left lunatics.”",
      "In his interview on “MediaBuzz,” Trump argued that Schiff wanted to put his son, Donald Trump Jr., in jail over the findings from the 2016 Russia investigation – or “scam” as Trump called it. He falsely claimed that they were spying on his campaign.",
      "“Think of how bad you have to be when you say you’re going to put any son, not just a president’s son, but any son. You’re going to put somebody in jail on a scam that you knew was made up by you. That’s an enemy from within,” he said.",
      "Trump also called Pelosi an “enemy from within,” claiming that she had the opportunity to protect the US Capitol as house speaker on January 6, 2021.",
      "CNN has previously fact checked these claims by Trump and found them to be false."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hsy7xa00513b6m4mztva1z\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20reiterates%20%22enemy%20from%20within%22%20comments%2C%20calls%20Schiff%20and%20Pelosi%20the%20%22enemy%22%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hsy7xa00513b6m4mztva1z",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hsy7xa00513b6m4mztva1z"
    },
    "completed": false
  },
  {
    "title": "Trump’s closing pitch to voters begins with a lewd story about a Hall of Fame golfer",
    "slug": "trumps-closing-pitch-to-voters-begins-with-a-lewd-story-about-a-hall-of-fame-golfer",
    "published_by": "From CNN's Steve Contorno and Kate Sullivan",
    "thumb": "",
    "metadata": "Former President Donald Trump speaks during a campaign rally in Latrobe, Pennsylvania, on October 19.",
    "contents": [
      "Donald Trump has pivoted to making his closing argument to voters heading into the final stretch of his race for the White House.",
      "Or so his campaign said Saturday as the former president took the stage in Latrobe, Pennsylvania.",
      "But shortly after walking out to a pro wrestler’s entrance music, Trump swiftly veered into a rambling anecdote about the late Arnold Palmer, the golfing legend after whom the local airport was named. The story, which seemed to serve little purpose beyond invoking a regional icon and which lasted nearly 15 minutes, included tangents on Palmer’s immense wealth and several offhand remarks about the Hall of Famer’s naked body.",
      "“Arnold Palmer was all man, and I say that in all due respect to women, I love women… This man was strong and tough, and I refused to say it, but when he took showers with the other pros they came out of there, they said ‘Oh my god. That’s unbelievable,’” Trump said.",
      "The anecdote prompted one rallygoer to comment, “I didn’t expect to hear that tonight.”",
      "Read more about Trump’s closing pitch here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hssth8004v3b6md5jg26ql\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Trump%E2%80%99s%20closing%20pitch%20to%20voters%20begins%20with%20a%20lewd%20story%20about%20a%20Hall%20of%20Fame%20golfer\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hssth8004v3b6md5jg26ql",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hssth8004v3b6md5jg26ql"
    },
    "completed": false
  },
  {
    "title": "Georgia secretary of state predicts record levels of early voting",
    "slug": "georgia-secretary-of-state-predicts-record-levels-of-early-voting",
    "published_by": "From CNN's Aileen Graef",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Georgia Secretary of State Brad Raffensperger said the Southern swing state will probably see record numbers of people voting early in the 2024 election, predicting 65% to 70% of Georgia voters will cast their ballots before Election Day.",
      "Referring to former President Donald Trump’s recent comment that Raffensperger and GOP Georgia Gov. Brian Kemp are “doing everything possible to make 2024 difficult for Republicans to win,” the secretary of state said such a comment “doesn’t influence me” and reiterated the voting security measures that have been implemented in the state."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hslw2r004j3b6mmi14a71d\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Georgia%20secretary%20of%20state%20predicts%20record%20levels%20of%20early%20voting\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hslw2r004j3b6mmi14a71d",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hslw2r004j3b6mmi14a71d"
    },
    "completed": false
  },
  {
    "title": "Harris attends church service in Georgia to mobilize early voting among Black voters",
    "slug": "harris-attends-church-service-in-georgia-to-mobilize-early-voting-among-black-voters",
    "published_by": "From CNN’s Ebony Davis in Stonecrest, Georgia",
    "thumb": "",
    "metadata": "Vice President Kamala Harris speaks in Stonecrest, Georgia, on October 20.",
    "contents": [
      "Vice President Kamala Harris on Sunday delivered remarks at New Birth Missionary Baptist Church in Stonecrest, Georgia, as part of a campaign push known as “souls to the polls” aimed at mobilizing early voting among Black voters.",
      "The vice president detailed growing up in church, where she said she often attended Sunday school and sang in the choir.",
      "Harris was dressed in a black suit and pink blouse in honor of the church’s “pink day” to raise awareness about breast cancer and reflected on her mother’s legacy as she highlighted the significance of attending Sunday’s service.",
      "“As some of you may know, my mother was a breast cancer researcher. She was one of the very few women, and fewer even women of color, who was engaged in studying breast cancer, and she had two goals in her life, to raise her two daughters, my sister Maya and me, and to end breast cancer,” Harris said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hrwwct003u3b6mqwy500b7\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Harris%20attends%20church%20service%20in%20Georgia%20to%20mobilize%20early%20voting%20among%20Black%20voters\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hrwwct003u3b6mqwy500b7",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hrwwct003u3b6mqwy500b7"
    },
    "completed": false
  },
  {
    "title": "Trump focuses on the border and illegal immigration as his closing message in final weeks of campaign",
    "slug": "trump-focuses-on-the-border-and-illegal-immigration-as-his-closing-message-in-final-weeks-of-campaign",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "",
    "metadata": "Migrants pass through razor wire after crossing the Rio Grande into El Paso, Texas, on February 1.",
    "contents": [
      "Former President Donald Trump focused on the US-Mexico border and illegal immigration when asked in a SiriusXM interview this weekend about what his closing message was in the final stretch of the 2024 campaign.",
      "“I happen to think that the biggest item is really going to be the border. It’s really the border. People, inflation is big, it’s horrible, it’s a country-buster and the economy and all of that but I happen to think that the border is going to be,” Trump said.",
      "Trump has repeatedly said he thinks the border and illegal immigration is the most important issue this election.",
      "Stoking fears about undocumented immigrants is a central part of Trump’s campaign message and he has ramped up his use of dehumanizing and degrading language of immigrants in the final stretch before Election Day.",
      "He has vowed to conduct mass deportations of undocumented immigrants, as he highlights instances of violent crime committed by undocumented immigrants and promotes false and sensationalized claims about Venezuelan gang members taking over parts of Colorado and Haitian migrants eating pets."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2housnh003k3b6mqy1k2yv9\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20focuses%20on%20the%20border%20and%20illegal%20immigration%20as%20his%20closing%20message%20in%20final%20weeks%20of%20campaign%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2housnh003k3b6mqy1k2yv9",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2housnh003k3b6mqy1k2yv9"
    },
    "completed": false
  },
  {
    "title": "Walz suggests Trump isn\u0026#39;t persuading voters during Michigan union stop",
    "slug": "walz-suggests-trump-isn39t-persuading-voters-during-michigan-union-stop",
    "published_by": "From CNN's Aaron Pellish in Saginaw, Michigan",
    "thumb": "",
    "metadata": "Minnesota Gov. Tim Walz speaks in Saginaw, Michigan, on October 20.",
    "contents": [
      "Democratic vice presidential candidate Gov. Tim Walz made the case that former President Donald Trump’s “floor and ceiling” for November’s presidential election are “about the same thing,” conceding that core Trump supporters will turn out for him in high numbers but arguing he is not persuading new voters to the same degree as Vice President Kamala Harris.",
      "Walz told a few dozen supporters at a plumbers’ union hall in Saginaw, Michigan, on Sunday that he believes high early voting numbers are coming from “new voters” and people who support Harris, rather than Trump supporters, whom he portrayed in particularly evocative terms.",
      "Walz also attacked Trump’s plan to increase tariffs, suggesting the plan would cause particular damage to rural farmers and business owners, and called Trump “a horrible businessman.”",
      "“I was just talking to a friend of mine. His brother has a custom combining business or whatever, tariffs on that and tariff on farmers are absolutely destructive. And I keep coming back to this. Let’s just dispel the myth in its entirety, Donald Trump was a horrible businessman, and he knows nothing about business right now,” Walz said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkl0pj00003b6mv1j0p5si\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EWalz%20suggests%20Trump%20isn't%20persuading%20voters%20during%20Michigan%20union%20stop%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkl0pj00003b6mv1j0p5si",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hkl0pj00003b6mv1j0p5si"
    },
    "completed": false
  },
  {
    "title": "Maryland governor says Black voters have a \u0026#34;natural skepticism\u0026#34; due to \u0026#34;pace of progress in America\u0026#34;",
    "slug": "maryland-governor-says-black-voters-have-a-34natural-skepticism34-due-to-34pace-of-progress-in-america34",
    "published_by": "From CNN's Lindy Royce-Bartlett",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Democratic Maryland Gov. Wes Moore believes recent poll numbers showing Vice President Kamala Harris struggling with Black voters have a lot to do with “skepticism.”",
      "“We’re all very clear that we don’t have a ten-to-one racial wealth gap because one group worked ten times harder, but there have been policies that have been put into place to make that happen,” Moore said during an appearance on “Fox News Sunday.”",
      "Moore believes proposals released this week by the Harris campaign zero in on key issues in the Black community and will help increase support among the key demographic.",
      "The proposals include providing forgivable loans to Black entrepreneurs, creating and investing in programs that provide opportunities for Black men, and addressing health challenges specific to the community."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hoh6zq00383b6m8dzhzc1i\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EMaryland%20governor%20says%20Black%20voters%20have%20a%20%22natural%20skepticism%22%20due%20to%20%22pace%20of%20progress%20in%20America%22%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hoh6zq00383b6m8dzhzc1i",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hoh6zq00383b6m8dzhzc1i"
    },
    "completed": false
  },
  {
    "title": "Graham defends Trump amid criticism of latest controversial comments",
    "slug": "graham-defends-trump-amid-criticism-of-latest-controversial-comments",
    "published_by": "From CNN's Sam Fossum",
    "thumb": "",
    "metadata": "",
    "contents": [
      "GOP Sen. Lindsey Graham, a staunch ally of former President Donald Trump, defended the Republican nominee amid criticism of his latest controversial comments, including his suggestion that he would use the military against the “enemy from within,” and whether they are the message he should be sending to voters.",
      "“We’re winning, and going to win not because of what Donald Trump saying, but because of what they’ve done for four years,” Graham said Sunday on NBC’s “Meet the Press.”",
      "In a repeated and heated back and forth with NBC’s Kristen Welker, Graham criticized former Trump officials and Republicans who now say the former president is unfit for office.",
      "“I think they’re wrong. I think they’re totally wrong,” Graham said, before going on to criticize the Biden-Harris administration."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hoc5xo002u3b6magjughck\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EGraham%20defends%20Trump%20amid%20criticism%20of%20latest%20controversial%20comments%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hoc5xo002u3b6magjughck",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hoc5xo002u3b6magjughck"
    },
    "completed": false
  },
  {
    "title": "As Harris turns 60, Democrats cast Trump as old and \u0026#34;unhinged\u0026#34;",
    "slug": "as-harris-turns-60-democrats-cast-trump-as-old-and-34unhinged34",
    "published_by": "From CNN's Eric Bradner",
    "thumb": "",
    "metadata": "Vice President Kamala Harris and former President Donald Trump.",
    "contents": [
      "Vice President Kamala Harris turns 60 on Sunday – and, her campaign wants voters to know, that makes her 18 years younger than Donald Trump.",
      "Harris’ campaign is increasingly questioning the former president’s mental and physical fitness in the final weeks of the 2024 presidential race.",
      "It’s a reversal of the strategy Republicans, led by Trump, used to attack President Joe Biden for years – and a remarkable turnaround for Democrats after the 81-year-old incumbent dropped out of the race in July.",
      "Harris herself has pointed to age repeatedly in recent days to differentiate herself from Biden – and, implicitly, the 78-year-old Trump, too.",
      "“I represent a new generation of leadership,” Harris said in an interview with Fox News on Wednesday.",
      "Read more about the Harris campaign’s strategy on Trump’s age here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hntj2v002k3b6mf7bok5lo\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=As%20Harris%20turns%2060%2C%20Democrats%20cast%20Trump%20as%20old%20and%20%22unhinged%22\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hntj2v002k3b6mf7bok5lo",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hntj2v002k3b6mf7bok5lo"
    },
    "completed": false
  },
  {
    "title": "Sanders defends Harris\u0026#39; move to the center, arguing that she is building a key \u0026#34;coalition\u0026#34;",
    "slug": "sanders-defends-harris39-move-to-the-center-arguing-that-she-is-building-a-key-34coalition34",
    "published_by": "From CNN's Aileen Graef",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Independent Sen. Bernie Sanders defended Vice President Kamala Harris’ campaign stops with Republicans and move to the center, saying that the dangers of a Trump presidency is causing people to overcome disagreements on key issues.",
      "Harris recently campaigned with former Republican Rep. Liz Cheney, who while conservative in her political views, has been a consistent and vocal critic of former President Donald Trump and has tried to make the case that his reelection would put American democracy at great risk.",
      "He also defended Harris’ moving to the center on issues such as single-payer healthcare and an end to fracking. While he maintained these are the issues he thinks will win with voters, he also acknowledged Democrats are trying to bring people together across the political spectrum."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hncr7100243b6m8nhgen0b\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Sanders%20defends%20Harris'%20move%20to%20the%20center%2C%20arguing%20that%20she%20is%20building%20a%20key%20%22coalition%22\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hncr7100243b6m8nhgen0b",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hncr7100243b6m8nhgen0b"
    },
    "completed": false
  },
  {
    "title": "Speaker Johnson defends Trump\u0026#39;s \u0026#34;enemy from within\u0026#34; remarks",
    "slug": "speaker-johnson-defends-trump39s-34enemy-from-within34-remarks",
    "published_by": "From CNN's Sam Fossum",
    "thumb": "",
    "metadata": "",
    "contents": [
      "House Speaker Mike Johnson repeatedly defended former President Donald Trump on Sunday in an interview with CNN’s Jake Tapper, choosing to deflect or not to answer when pressed about Trump’s latest controversial comments such as his vulgar remarks about Arnold Palmer or his suggestion that he would use the military against the “enemy from within.”",
      "In a back and forth with the speaker, Tapper asked whether Trump’s comments in Pennsylvania about the former pro golfer’s genitalia were the closing message Johnson wants voters to hear.",
      "When pressed by Tapper about Trump’s cognitive state and fitness for office, Johnson rejected the idea that Trump was unfit for the presidency.",
      "When asked about Trump’s suggestion to use the military against the “enemy from within” on Election Day, Johnson started by arguing that the former president was referring to criminal or transnational gangs.",
      "“What he’s talking about is marauding gangs,” Johnson said.",
      "But when Tapper pushed back, noting that Trump has described Democrats such as Rep. Adam Schiff as the “enemy from within,” Johnson said Trump was not talking about using the military on political opponents.",
      "“I did not hear President Trump in that clip say he’s going to sic the military on Adam Schiff. That’s not what he’s saying,” Johnson said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hm9smy00183b6m7y0ofqgi\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ESpeaker%20Johnson%20defends%20Trump's%20%22enemy%20from%20within%22%20remarks%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hm9smy00183b6m7y0ofqgi",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hm9smy00183b6m7y0ofqgi"
    },
    "completed": false
  },
  {
    "title": "Trump thrusts McDonald’s into the political arena in final days of campaign",
    "slug": "trump-thrusts-mcdonalds-into-the-political-arena-in-final-days-of-campaign",
    "published_by": "From CNN's Steve Contorno",
    "thumb": "",
    "metadata": "The McDonald's logo is displayed at a restaurant in Burbank, California, on July 22.",
    "contents": [
      "Donald Trump is pulling one of the most iconic American companies – McDonald’s – into the political arena in the final days of his third White House bid.",
      "The former president is expected to stop by one of the fast-food chain’s Pennsylvania franchises during his Sunday swing through the Keystone State. There, he plans to work as a fry attendant, CNN reported last week.",
      "It’s the same job Vice President Kamala Harris has said she held as a young woman, a biographical detail revealed during her first campaign for president. It has since become a centerpiece of the middle class origin story she has made key to her pitch to voters as the Democratic Party’s presidential nominee.",
      "Trump, whose deep affection for the Golden Arches and its offerings is well documented, has meanwhile grown fixated on Harris’ employment there. In interviews and on the campaign trail, he regularly accuses Harris – without evidence – of making up the factoid. His visit to the restaurant is his latest attempt to sow doubt about the Democrat’s work history.",
      "Read more about Trump and Harris’ relationship with the Golden Arches here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hl520v000q3b6m94tjwyhy\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Trump%20thrusts%20McDonald%E2%80%99s%20into%20the%20political%20arena%20in%20final%20days%20of%20campaign\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hl520v000q3b6m94tjwyhy",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hl520v000q3b6m94tjwyhy"
    },
    "completed": false
  },
  {
    "title": "Obama emphasizes \u0026#34;everything a president says is serious\u0026#34; to people excusing Trump\u0026#39;s behavior",
    "slug": "obama-emphasizes-34everything-a-president-says-is-serious34-to-people-excusing-trump39s-behavior",
    "published_by": "From CNN's Veronica Stracqualursi",
    "thumb": "",
    "metadata": "Former President Barack Obama speaks during a campaign rally in support of Vice President Kamala Harris in North Las Vegas on October 19.",
    "contents": [
      "Former President Barack Obama on Saturday took people to task whom he said have “made excuses” for former President Donald Trump’s behavior as him being funny or unserious, arguing that “everything a president says is serious.”",
      "Obama, who has been attempting to help Vice President Kamala Harris shore up support with Black men, said that he’s noticed this “especially among some men who seem to think Trump’s behavior of bullying people or putting them down is somehow a macho sign of strength.”",
      "“That’s what we should want in our sons and our daughters. That’s what I want to see in the president of the United States,” he added."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkua3600053b6mm498bmvs\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EObama%20emphasizes%20%22everything%20a%20president%20says%20is%20serious%22%20to%20people%20excusing%20Trump's%20behavior%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkua3600053b6mm498bmvs",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hkua3600053b6mm498bmvs"
    },
    "completed": false
  },
  {
    "title": "How a one-time GOP critic found alliance with Trump in pivotal Michigan Senate race",
    "slug": "how-a-one-time-gop-critic-found-alliance-with-trump-in-pivotal-michigan-senate-race",
    "published_by": "From CNN's Manu Raju and Morgan Rimmer",
    "thumb": "",
    "metadata": "",
    "contents": [
      "The day after January 6, 2021, Mike Rogers was blunt.",
      "The former Republican congressman blamed then-President Donald Trump’s “chaotic leadership style” for costing his party two critical Senate seats in Georgia. And in discussing a news report a week later saying that Trump privately acknowledged some responsibility for the attack, Rogers made his own view crystal clear.",
      "Nearly four years later, as Rogers now battles Democratic Rep. Elissa Slotkin for a prized Senate seat in Michigan, Rogers and Trump are in a much different place, a relationship solidified over phone calls that led to Trump’s crucial primary endorsement of Rogers earlier this year.",
      "Rogers’ evolution on Trump underscores both the former president’s enduring grip on the party and the calculation down-ticket Republicans have made in navigating the polarizing presence atop their ticket.",
      "Read more about the deeply competitive Michigan Senate race here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkq1he00003b6msuy3ril5\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=How%20a%20one-time%20GOP%20critic%20found%20alliance%20with%20Trump%20in%20pivotal%20Michigan%20Senate%20race\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2hkq1he00003b6msuy3ril5",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2hkq1he00003b6msuy3ril5"
    },
    "completed": false
  },
  {
    "title": "Harris defends strategy shift to sharpen attacks on Trump",
    "slug": "harris-defends-strategy-shift-to-sharpen-attacks-on-trump",
    "published_by": "From CNN’s Ebony Davis",
    "thumb": "",
    "metadata": "Vice President Kamala Harris waves to the crowd before speaking at a campaign rally in Atlanta on Saturday.",
    "contents": [
      "Vice President Kamala Harris on Saturday said the shift in her campaign strategy to sharpen attacks on former President Donald Trump in recent days is because “he’s becoming increasingly unstable and unhinged.”",
      "“He’s becoming increasingly unstable and unhinged, and it requires that response. I think the American people are seeing it,” Harris said to reporters in Detroit when asked about ramping up attacks on Trump.",
      "Ahead of a get-out-the-vote event in Michigan, Harris praised the recent record early voting in battleground Georgia as she encouraged voters to cast ballots ahead of Election Day.",
      "“I think it’s great that people are turning out and voting and being active,” she said, adding that Americans should all want people to understand “their civic duty but also that they can make a difference.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2giddf800003b6mhy8y18cj\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Harris%20defends%20strategy%20shift%20to%20sharpen%20attacks%20on%20Trump\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2giddf800003b6mhy8y18cj",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2giddf800003b6mhy8y18cj"
    },
    "completed": false
  },
  {
    "title": "Here’s a look into Trump, Harris and their allies’ ad spending strategies in October",
    "slug": "heres-a-look-into-trump-harris-and-their-allies-ad-spending-strategies-in-october",
    "published_by": "From CNN’s David Wright and Alex Leeds Matthews",
    "thumb": "",
    "metadata": "",
    "contents": [
      "In the first two weeks of October, Donald Trump and his allies directed about a third of all their spending on broadcast TV advertisements to ads about transgender health care, a significant increase reflecting a major tactical shift from previous months’ ad expenditures.",
      "On the other side, Kamala Harris and her allies continued to put money into ads focused on taxes, character and health care, while lowering their investment in spots about abortion rights. Democrats have also abandoned an earlier emphasis on immigration and crime when Harris and her allies sought to blunt sustained GOP attacks in the weeks after she took over the ticket.",
      "The ad tracking firm AdImpact catalogs the issues that are referenced in broadcast TV campaign ads and tracks the amount of money behind those spots. Comparing changes since August illustrates how the two campaigns and their allies are tailoring their messages and how much they’re spending to do so.",
      "Pro-Trump campaign ads: Since the beginning of October, Republican advertisers in the presidential race have flooded the airwaves in battleground states with a series of stark attack ads, blasting Harris for previously expressing support for taxpayer-funded gender transition surgeries for detained immigrants and federal prisoners, a position she took during her unsuccessful 2020 presidential campaign.",
      "Pro-Harris campaign ads: In the first two weeks of October, tax policy was the top issue, as spots about taxation drew about half of all broadcast TV ad spending. Taxation has been a consistent point of emphasis in Democratic presidential advertising, part of a two-pronged approach — touting Harris’ tax policies aimed at working and middle-class families while attacking Trump’s approach and criticizing tax cuts for corporations and top earners.",
      "Read more on ad spending here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2gid91c003y2cp64m4b6cl2\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Here%E2%80%99s%20a%20look%20into%20Trump%2C%20Harris%20and%20their%20allies%E2%80%99%20ad%20spending%20strategies%20in%20October\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2gid91c003y2cp64m4b6cl2",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2gid91c003y2cp64m4b6cl2"
    },
    "completed": false
  },
  {
    "title": "Harris campaign to visit churches on Sunday to encourage early voting among Black voters",
    "slug": "harris-campaign-to-visit-churches-on-sunday-to-encourage-early-voting-among-black-voters",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "",
    "metadata": "Vice President Kamala Harris speaks during a campaign event in Atlanta on Saturday.",
    "contents": [
      "Members of the Harris campaign will visit churches across swing states Sunday to make an early voting push to Black voters, according to a campaign official.",
      "Vice President Kamala Harris will deliver remarks during a service at New Birth Missionary Baptist Church in Stonecrest, Georgia, the campaign said. She will then attend an additional “Souls to the Polls” event at Divine Faith Ministries International, where she will urge churchgoers to vote ahead of Election Day. Prior to her arrival, legendary singer Stevie Wonder is set to perform and deliver remarks.",
      "The campaign launched the “Souls to the Polls” initiative last week on a national call featuring gospel performances, national and state faith leaders, senior elected officials and campaign surrogates. The effort is led by a board of Black faith leaders who will travel across battleground states as an all-hands-on-deck effort.",
      "Harris will also sit down with the Rev. Al Sharpton for an interview airing at 5 p.m. ET on MSNBC.",
      "Harris’ running mate, Minnesota Gov. Tim Walz, will attend church service at Victorious Believers Ministries in Saginaw, Michigan. His wife, Gwen Walz, will join Congressional Black Caucus Chair Steven Horsford at Nehemiah Ministries Christian Church in Las Vegas."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2h1kras00003b6mmne1ivbm\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Harris%20campaign%20to%20visit%20churches%20on%20Sunday%20to%20encourage%20early%20voting%20among%20Black%20voters\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2h1kras00003b6mmne1ivbm",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2h1kras00003b6mmne1ivbm"
    },
    "completed": false
  },
  {
    "title": "Both campaigns will continue their battleground swings today. Here\u0026#39;s what to know",
    "slug": "both-campaigns-will-continue-their-battleground-swings-today-here39s-what-to-know",
    "published_by": "From CNN staff",
    "thumb": "",
    "metadata": "Vice President Kamala Harris and former President Donald Trump",
    "contents": [
      "The presidential candidates, along with their running mates, will bring their pitches to voters in critical swing states Sunday as the race for the White House enters its final leg.",
      "Here’s where they’ll be:",
      "Vice President Kamala Harris will deliver remarks at the New Birth Missionary Baptist Church in Stonecrest, Georgia, on Sunday morning before attending a “Souls to the Polls” voter mobilization event. Later in the day, MSNBC will air an interview with Al Sharpton and the vice president.",
      "Harris’ running mate, Minnesota Gov. Tim Walz, will start his day at a church service in Saginaw, Michigan, before delivering remarks at campaign receptions in Boston and Greenwich, Connecticut.",
      "Second gentleman Doug Emhoff will also make the case for the Harris-Walz ticket in Michigan on Sunday, delivering remarks at a Jewish voters event in Detroit and joining billionaire entrepreneur Mark Cuban to highlight Harris’ vision for small businesses in Grand Rapids. And former President Bill Clinton will talk to voters in eastern North Carolina on Sunday, concluding his four-day swing in the state on behalf of campaign.",
      "Meanwhile, former President Donald Trump is expected to hold a campaign town hall in Lancaster, Pennsylvania. While in the battleground state, he is expected to visit a McDonald’s and work the fry cooker as he continues to baselessly claim that Harris never worked at the fast-food chain.",
      "Trump’s running mate, Ohio Sen. JD Vance, will attend the Green Bay Packers vs. Houston Texans football game in Green Bay before attending campaign event in Waukesha, Wisconsin."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2h1a8wk00003b6mi3x7xpz2\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Both%20campaigns%20will%20continue%20their%20battleground%20swings%20today.%20Here's%20what%20to%20know\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-20-24%23cm2h1a8wk00003b6mi3x7xpz2",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-20-24#cm2h1a8wk00003b6mi3x7xpz2"
    },
    "completed": false
  }
]