[
  {
    "title": "Obama will rally support for Harris across several key battleground states",
    "slug": "obamawill-rally-support-for-harris-across-several-key-battleground-states",
    "published_by": "From CNN's Kevin Liptak",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1239766516.jpg?c=original",
    "metadata": "In this 2022 file photo, Vice President Kamala Harris and former President Barack Obama attend an event to mark the 2010 passage of the Affordable Care Act in the East Room of the White House in Washington, DC.",
    "contents": [
      "Former President Barack Obama plans to commence a 27-day campaign sprint for Vice President Kamala Harris this week in Pennsylvania, an adviser to the Democratic presidential nominee’s campaign said last week, hoping his star power among Democrats can help propel her to the office he once held.",
      "Openly concerned about Democratic complacency and acutely aware of razor-thin margins in polls, Obama — who, along with his wife, Michelle, is one of the party’s most popular figures — is seeking to help Harris in any way he can, aides have said.",
      "The Thursday rally in Pittsburgh will be the first in a string of events Obama plans to hold across electoral battlegrounds in the weeks ahead of Election Day, according to a senior Harris campaign official.",
      "Aside from rallies, an Obama aide said the former president intends to help Democrats by recording candidate-specific advertisements and lending his name to email solicitations for campaign cash, including for down-ballot races. He headlined a $4 million fundraiser for Harris in Los Angeles last month.",
      "The 2024 election, in Obama’s view, is an “all hands on deck” moment, aides have said.",
      "The event was Obama’s first solo fundraising appearance for Harris since she secured the Democratic nomination over the summer, and it brought the total amount he’s raised through events and fundraising content for Democrats to more than $76 million, his office said at the time.",
      "There is little question Obama would have offered his campaign talents to President Joe Biden if he’d remained in the race. Still, Obama was among the party elders whose quiet maneuvering over the summer helped Biden, his former vice president, realize that Democrats were headed to almost certain defeat if he stayed on the ticket.",
      "And in his August speech at the Democratic National Convention, Obama cast Harris as an inheritor of the political movement he began in 2008, saying she could “chart a new way forward to meet the challenges of today.”"
    ]
  },
  {
    "title": "Harris says it’s \u0026#34;unconscionable\u0026#34; for leaders to push hurricane misinformation",
    "slug": "harris-says-its-34unconscionable34-for-leaders-to-push-hurricane-misinformation",
    "published_by": "From CNN's Michael Williams and Donald Judd",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-10-08t145130z-359023849-rc2wfaa25vw2-rtrmadp-3-usa-election-harris.jpg?c=original",
    "metadata": "Vice President Kamala Harris speaks in Washington, DC, on October 7.",
    "contents": [
      "Vice President Kamala Harris sought to counter rampant misinformation around the federal government’s response to Hurricanes Helene and Milton Wednesday, telling CNN in an interview that comments suggesting that federal assistance has run out from former President Donald Trump and his allies is “unconscionable” and could serve to discourage people in the path of the storm from seeking much-needed aid.",
      "“It is dangerous — it is unconscionable, frankly, that anyone who would consider themselves a leader would mislead desperate people to the point that those desperate people would not receive the aid to which they are entitled, and that’s why I call it dangerous,” Harris told CNN’s Dana Bash on Wednesday. “And we all know it’s dangerous, and the gamesmanship has to stop at some point, the politics have to end, especially in a moment of crisis.”",
      "Harris also thanked some of the local elected officials who are working to bat down misinformation surrounding Hurricanes Helene and Milton, while saying she’s seen no indication that foreign interference is responsible for the false deluge.",
      "Harris told Bash that local leaders are “doing an extraordinary job in trying to combat the misinformation. I’m talking about sheriffs, I’m talking about mayors, I’m talking about local officials — I don’t even know their party affiliation.”",
      "Asked whether she’s seen any indication that the rumors come from foreign sources — as some officials, including Tennessee Gov. Bill Lee have suggested — Harris said she had not.",
      "“No, I do not,” Harris said. But she added that whatever the source, the misinformation ” hurts the American people. And it’s got to stop.”",
      "Harris said the last thing people evacuating from the storm “deserve is to have a so-called leader make them more afraid than they already are.”",
      "More context: Harris has taken an increasingly visible role in the administration’s response efforts in the wake of both hurricanes since rising to the top of her party’s presidential ticket in July, traveling to the region on her own to survey recovery efforts and even ending a campaign swing early to participate in briefings.",
      "Harris also participated in an administration briefing ahead of Milton making landfall earlier Wednesday, lobbing questions to federal officials while joining virtually from New York, where she was traveling for media interviews."
    ]
  }
]