[
  {
    "title": "Pro-Trump advertisers launch wave of new ads targeting Harris over transgender policies",
    "slug": "pro-trump-advertisers-launch-wave-of-new-ads-targeting-harris-over-transgender-policies",
    "published_by": "From CNN's David Wright",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Pro-Trump outside groups added to a flood of attack ads targeting Vice President Kamala Harris this week, launching a wave of new spots covering a range of issues, including transgender policies – a growing point of emphasis in Republican advertising.",
      "Preserve America – a leading pro-Trump super PAC that has received millions from megadonor Miriam Adelson – went up Wednesday with a pair of spots that included criticism of Harris for expressing support for taxpayer-funded gender transition surgeries for detained immigrants and federal prisoners during her 2020 presidential campaign.",
      "“With high inflation, working families like mine are hurting and Kamala Harris helped create this mess,” says a Wisconsin voter featured in one of the ads. “Now, while Americans struggle, Kamala spent our tax dollars putting illegal immigrants up in hotel rooms and she supported spending our tax dollars to give illegals sex changes. It’s not just liberal, it’s insane.”",
      "Other leading pro-Trump outside groups have also ramped up their advertising about LGBTQ rights targeting Harris.",
      "MAGA Inc., the super PAC that has spent the most money supporting Trump’s 2024 campaign, launched an ad Tuesday that said “Kamala will give criminal illegal aliens taxpayer funded transgender surgeries,” then adding, “Crazy liberal Kamala is for they/them. President Trump is for you.”",
      "The ads reflect a pronounced messaging shift from Republican advertisers, including the Trump campaign itself, which has ramped up its focus on LGBTQ rights and transgender health care policies with a series of new ads in the beginning of October. On Wednesday, the Trump campaign launched a Spanish-language version of one of its spots attacking Harris on the issue."
    ]
  },
  {
    "title": "Harris launches latest ad aimed at crossover voters, slamming Trump’s disaster relief record",
    "slug": "harris-launches-latest-ad-aimed-at-crossover-voters-slamming-trumps-disaster-relief-record",
    "published_by": "From CNN's David Wright",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Kamala Harris’ presidential campaign went up Thursday with the latest in a series of TV ads aimed at undercutting favorable impressions of Donald Trump’s first-term in office and winning over Republican voters.",
      "The new ad features several former Trump administration officials slamming his leadership and personal conduct, including harsh criticism of Trump’s approach to disaster relief, as the current hurricane season impacts the 2024 campaign.",
      "“Right. I worked in the Trump administration,” says Kevin Carroll, another official featured in the ad. “He would suggest not giving disaster relief to states that hadn’t voted for him.”",
      "More on Harris’ ad campaign: The ad includes several clips of controversial moments from Trump’s administration, as it dealt with hurricanes, including footage of Trump tossing paper towel rolls to victims of a hurricane in Puerto Rico in 2017, and images of a map that Trump altered with a sharpie marker, intended to indicate the track of Hurricane Dorian in 2019.",
      "The ad first began airing this morning in Georgia, among the states severely impacted by Hurricane Helene earlier this month.",
      "It’s the latest in a series of ads from the Harris campaign that feature critical former Trump administration officials and other anti-Trump Republicans, as the campaign makes a concerted push for crossover voters."
    ]
  },
  {
    "title": "Democrats and GOP locked in key Senate races in Florida, Texas and Montana: Here\u0026#39;s a polling roundup",
    "slug": "democrats-and-gop-locked-in-key-senate-races-in-florida-texas-and-montana-here39s-a-polling-roundup",
    "published_by": "From CNN's Jennifer Agiesta",
    "thumb": "",
    "metadata": "",
    "contents": [
      "New polling this morning from Ohio and Montana shows the difficulty Democratic Senate incumbents face in two states that are all but certain to break for former President Donald Trump in this year’s presidential contest. And surveys out of Florida and Texas paint a mixed picture on how Democratic challengers to Republican senators in those two states are faring.",
      "New polling from both Marist College and the Washington Post finds Democratic Sen. Sherrod Brown locked in a tight race with no clear leader against Republican Bernie Moreno in Ohio. In the Marist poll, the race stands at 50% Brown to 48% Moreno among likely voters, while the Post’s poll finds Brown at 48% to Moreno’s 47% among likely voters. Trump leads Vice President Kamala Harris by 6 points among likely voters in the Buckeye State in both surveys.",
      "In Montana, a new poll from the New York Times and Siena College is the first high-quality poll of the state this fall, and suggests Democratic Sen. Jon Tester trails his Republican challenger, Tim Sheehy, by a wide margin, 52% of likely voters there back Sheehy, 44% Tester. The state breaks solidly for Trump in the presidential matchup, 56% back him, 39% Harris among likely voters in the poll.",
      "In Texas, the Marist College poll finds Republican Sen. Ted Cruz leading Democratic challenger Colin Allred 51% to 46% among likely voters, just outside the poll’s margin of sampling error. The New York Times/Siena College survey suggests a somewhat tighter race, with Cruz at 48% to Allred’s 44% among likely voters, just inside the poll’s 4.8 point margin of sampling error. Both surveys find Trump ahead of Harris by 7 points.",
      "And in Florida, polling conducted before Hurricane Milton from Marist College and from the New York Times/Siena College suggest different states of play in the Sunshine State. The Times/Siena poll finds a deeply Republican tilt, with Trump ahead by 13 points and Republican Sen. Rick Scott broadly leading his Democratic challenger, Debbie Mucarsel-Powell, 49% for Scott to 40% for Mucarsel-Powell among likely voters. In the Marist survey, Trump leads Harris 51% to 47% among likely voters, just outside the poll’s margin of error, while it finds no clear leader in the Senate contest, with Scott at 50% and Mucarsel-Powell at 48% among likely voters."
    ]
  },
  {
    "title": "Here\u0026#39;s what the candidates have on their schedule on Thursday",
    "slug": "here39s-what-the-candidates-have-on-their-schedule-on-thursday",
    "published_by": "From CNN staff",
    "thumb": "",
    "metadata": "",
    "contents": [
      "The 2024 candidates are busy campaigning with less than a month until Election Day. As they race to make their final pitches to voters, here’s what’s on their schedule today:",
      "Vice President Kamala Harris will participate at a Univision town hall in Las Vegas, Nevada before traveling to Phoenix, Arizona, where she will deliver remarks at a campaign event in Chandler, Arizona at 9:30 p.m. ET.",
      "Harris, along with President Joe Biden, is expected to attend a briefing on Hurricanes Milton and Helene in the White House Situation Room at 11 a.m. ET.",
      "Former President Donald Trump will deliver an address to the Detroit Economic Club in Detroit, Michigan at 1 p.m. ET.",
      "There is no clear leader in the latest Quinnipiac University Michigan poll (50% Trump, 47% Harris, with a 3.1 percentage point margin of sampling error), while the September poll showed Harris holding a lead (50% Harris to 45% Trump).",
      "Minnesota Gov. Tim Walz will participate in an “Out for Harris-Walz” national organizing call at 8 p.m. ET hosted by the Human Rights Campaign, Out for Harris and LGBTQ+ leaders across the country.",
      "Ohio Sen. JD Vance will host a town hall in Greensboro, North Carolina at 6 p.m. ET, and professional race car driver Danica Patrick will moderate the town hall.",
      "Former President Barack Obama will travel to Pittsburgh, Pennsylvania to headline a rally on behalf of the Harris-Walz ticket and Democrats.",
      "The Thursday rally in Pittsburgh will be the first in a string of events Obama plans to hold across electoral battlegrounds in the weeks ahead of Election Day, according to a senior Harris campaign official.",
      "Pennsylvania is a pivotal piece in assembling a pathway to 270 electoral votes this November. As the biggest battleground prize with 19 electoral votes, Pennsylvania has seen an outsized share of candidate visits and campaign resources."
    ]
  },
  {
    "title": "Trump dismisses invitation to debate with Harris again: \u0026#34;There will be no rematch\u0026#34;",
    "slug": "trump-dismisses-invitation-to-debate-with-harris-again-34there-will-be-no-rematch34",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177680756.jpg?c=original",
    "metadata": "Former President Donald Trump delivers remarks at a campaign rally in Reading, Pennsylvania, on October 9, 2024.",
    "contents": [
      "Former President Donald Trump said Wednesday there will be “no rematch” and said, “there is nothing to debate” after Fox News proposed hosting another presidential debate in Pennsylvania later this month.",
      "“It is very late in the process, voting has already begun - there will be no rematch! Besides, Kamala stated clearly, yesterday, that she would not do anything different than Joe Biden, so there is nothing to debate,” Trump wrote in an all-caps post on his Truth Social platform.",
      "Fox said earlier in the day it had sent letters to Trump’s and Kamala Harris’ campaigns proposing another debate in Pennsylvania on October 24 or 27, with Fox News’ Bret Baier and Martha MacCallum as moderators.",
      "The Republican nominee again claimed he “won the last two debates” and said he had accepted Fox News’ previous invitation to participate in a debate last month that Harris did not accept.",
      "CNN has also offered to host a debate in Atlanta on October 23, as the window for a final 2024 presidential matchup narrows. Harris has accepted CNN’s invitation, but Trump has rejected her calls for a rematch. CNN has set a Thursday deadline for the candidates to formally respond to the invitation."
    ]
  },
  {
    "title": "Obama will rally support for Harris across several key battleground states",
    "slug": "obamawill-rally-support-for-harris-across-several-key-battleground-states",
    "published_by": "From CNN's Kevin Liptak",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1239766516.jpg?c=original",
    "metadata": "In this 2022 file photo, Vice President Kamala Harris and former President Barack Obama attend an event to mark the 2010 passage of the Affordable Care Act in the East Room of the White House in Washington, DC.",
    "contents": [
      "Former President Barack Obama plans to commence a 27-day campaign sprint for Vice President Kamala Harris this week in Pennsylvania, an adviser to the Democratic presidential nominee’s campaign said last week, hoping his star power among Democrats can help propel her to the office he once held.",
      "Openly concerned about Democratic complacency and acutely aware of razor-thin margins in polls, Obama — who, along with his wife, Michelle, is one of the party’s most popular figures — is seeking to help Harris in any way he can, aides have said.",
      "The Thursday rally in Pittsburgh will be the first in a string of events Obama plans to hold across electoral battlegrounds in the weeks ahead of Election Day, according to a senior Harris campaign official.",
      "Aside from rallies, an Obama aide said the former president intends to help Democrats by recording candidate-specific advertisements and lending his name to email solicitations for campaign cash, including for down-ballot races. He headlined a $4 million fundraiser for Harris in Los Angeles last month.",
      "The 2024 election, in Obama’s view, is an “all hands on deck” moment, aides have said.",
      "The event was Obama’s first solo fundraising appearance for Harris since she secured the Democratic nomination over the summer, and it brought the total amount he’s raised through events and fundraising content for Democrats to more than $76 million, his office said at the time.",
      "There is little question Obama would have offered his campaign talents to President Joe Biden if he’d remained in the race. Still, Obama was among the party elders whose quiet maneuvering over the summer helped Biden, his former vice president, realize that Democrats were headed to almost certain defeat if he stayed on the ticket.",
      "And in his August speech at the Democratic National Convention, Obama cast Harris as an inheritor of the political movement he began in 2008, saying she could “chart a new way forward to meet the challenges of today.”"
    ]
  },
  {
    "title": "Harris and Biden step up public engagement about the dangers of Hurricane Milton",
    "slug": "harris-and-biden-step-up-public-engagement-about-the-dangers-of-hurricane-milton",
    "published_by": "From CNN's Michael Williams",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24283793396064.jpg?c=original",
    "metadata": "President Joe Biden speaks about Hurricane Milton from the Roosevelt Room at the White House in Washington, DC, on October 9.",
    "contents": [
      "Ahead of Hurricane Milton’s landfall, President Joe Biden and Vice President Kamala Harris have forcefully warned Americans multiple times on Wednesday about what the president is calling “the storm of the century.”",
      "Biden and Harris’ attempt to get out in front of this latest hurricane is a reflection of the severity of the storm, the misinformation about the federal response to Hurricane Helene that the administration is trying to combat — and a looming election that raises the stakes for a successful government response.",
      "Both leaders participated in and asked questions during a televised briefing with officials from the National Weather Service and Federal Emergency Management Agency — Biden in-person from the White House, and Harris joining remotely from New York, where she stayed overnight after participating in a series of interviews. The vice president later called into CNN and the Weather Channel for interviews about the storm, telling CNN’s Dana Bash that it’s “unconscionable” for leaders to push hurricane misinformation.",
      "Americans heard from Biden — who postponed this week’s overseas trip to Germany and Angola — about his administration’s response to the storm no less than three separate times on Wednesday, including the briefing, a call with rabbis where the president referenced the hurricane, and separate remarks on Milton later in the afternoon from the Roosevelt Room of the White House.",
      "Harris’ visible role on the storm response comes as Hurricane Helene and now Milton have become part of the 2024 campaign, with less than four weeks to go before Election Day.",
      "Keep reading here about how Biden and Harris are responding to the hurricane."
    ]
  },
  {
    "title": "Harris says it’s \u0026#34;unconscionable\u0026#34; for leaders to push hurricane misinformation",
    "slug": "harris-says-its-34unconscionable34-for-leaders-to-push-hurricane-misinformation",
    "published_by": "From CNN's Michael Williams and Donald Judd",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-10-08t145130z-359023849-rc2wfaa25vw2-rtrmadp-3-usa-election-harris.jpg?c=original",
    "metadata": "Vice President Kamala Harris speaks in Washington, DC, on October 7.",
    "contents": [
      "Vice President Kamala Harris sought to counter rampant misinformation around the federal government’s response to Hurricanes Helene and Milton Wednesday, telling CNN in an interview that comments suggesting that federal assistance has run out from former President Donald Trump and his allies is “unconscionable” and could serve to discourage people in the path of the storm from seeking much-needed aid.",
      "“It is dangerous — it is unconscionable, frankly, that anyone who would consider themselves a leader would mislead desperate people to the point that those desperate people would not receive the aid to which they are entitled, and that’s why I call it dangerous,” Harris told CNN’s Dana Bash on Wednesday. “And we all know it’s dangerous, and the gamesmanship has to stop at some point, the politics have to end, especially in a moment of crisis.”",
      "Harris also thanked some of the local elected officials who are working to bat down misinformation surrounding Hurricanes Helene and Milton, while saying she’s seen no indication that foreign interference is responsible for the false deluge.",
      "Harris told Bash that local leaders are “doing an extraordinary job in trying to combat the misinformation. I’m talking about sheriffs, I’m talking about mayors, I’m talking about local officials — I don’t even know their party affiliation.”",
      "Asked whether she’s seen any indication that the rumors come from foreign sources — as some officials, including Tennessee Gov. Bill Lee have suggested — Harris said she had not.",
      "“No, I do not,” Harris said. But she added that whatever the source, the misinformation ” hurts the American people. And it’s got to stop.”",
      "Harris said the last thing people evacuating from the storm “deserve is to have a so-called leader make them more afraid than they already are.”",
      "More context: Harris has taken an increasingly visible role in the administration’s response efforts in the wake of both hurricanes since rising to the top of her party’s presidential ticket in July, traveling to the region on her own to survey recovery efforts and even ending a campaign swing early to participate in briefings.",
      "Harris also participated in an administration briefing ahead of Milton making landfall earlier Wednesday, lobbing questions to federal officials while joining virtually from New York, where she was traveling for media interviews."
    ]
  }
]