[
  {
    "title": "How hurricane season is affecting the way Americans follow the Trump-Harris race",
    "slug": "how-hurricane-season-is-affecting-the-way-americans-followthe-trump-harris-race",
    "published_by": "From CNN's Ariel Edwards-Levy",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/wip01-ap24274635930569-jpg-jpg.jpg?c=original",
    "metadata": "Debris is seen in the aftermath of Hurricane Helene in Asheville, North Carolina, on September 30.",
    "contents": [
      "With the election less than a month away, the public’s attention has shifted to the candidates’ responses to the hurricane season, according to The Breakthrough, a CNN polling project that tracks what average Americans are actually hearing, reading and seeing about the presidential nominees throughout the campaign.",
      "In the wake of Hurricane Helene, which has killed more than 230 people across the Southeastern United States, “hurricane” was the word most frequently mentioned when respondents were asked what they’d heard about former President Donald Trump. It was the second-most frequent word mentioned when they were asked about Vice President Kamala Harris, second only to “campaign.” The poll was fielded from October 4-7, before Hurricane Milton made landfall in Florida on Wednesday night.",
      "Democrats and Republicans were about equally likely to mention the hurricane when talking about Harris — although their perspectives on her response often differed sharply.",
      "Harris “was working with FEMA on providing assistance and recovery for the areas affected by Hurricane Helene,” one Democratic respondent wrote, while another credited her with having done “a great job of consoling hurricane victims in Georgia.”",
      "By contrast, a Republican respondent wrote about hearing that Harris “is only paying $750 to those whose homes are being devastated in the hurricanes, yet sending billions upon billions of dollars to Ukraine and Israel.” The $750 is an apparent reference to a payment program at the Federal Emergency Management Agency that has been mischaracterized by Trump and others as the only assistance FEMA is providing.",
      "Read more here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ym8ma001b3b6mkj61742k\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=How%20hurricane%20season%20is%20affecting%20the%20way%20Americans%20follow%C2%A0the%20Trump-Harris%20race\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ym8ma001b3b6mkj61742k",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27ym8ma001b3b6mkj61742k"
    },
    "completed": false
  },
  {
    "title": "Analysis: Why do we still have the Electoral College?",
    "slug": "analysis-why-do-we-still-have-the-electoral-college",
    "published_by": "From CNN's Zachary B. Wolf",
    "thumb": "",
    "metadata": "",
    "contents": [
      "The way Americans choose their president is wonky at best and antidemocratic at worst.",
      "While the Electoral College has its defenders, there’s a much deeper bench of people who don’t understand exactly why it is that 538 electors, not 330 million-plus American voters, actually pick the president.",
      "The way it functions today — with electors acting as proxies for voters — is nothing like what the founders who created the Electoral College had in mind. They wanted electors to actually debate and consider multiple options.",
      "In the intervening centuries, both chambers of Congress have voted to change the Electoral College — most recently in 1969 — but these efforts all ultimately failed. If, as is possible, one candidate gets more votes in November and the other candidate gets the White House, expect a new round of bellyaching about this anachronism that somehow lives on.",
      "A new book dissects the history of the Electoral College. Its author, Carolyn Dupont, a history professor at Eastern Kentucky University who describes herself as a moderate Democrat, comes down in favor of adopting a national popular vote model.",
      "I talked to Dupont about the Electoral College. Read our conversation here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27w4vb3000q3b6m2arrr110\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Analysis%3A%20Why%20do%20we%20still%20have%20the%20Electoral%20College%3F\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27w4vb3000q3b6m2arrr110",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27w4vb3000q3b6m2arrr110"
    },
    "completed": false
  },
  {
    "title": "Trump continues his dark anti-immigrant rhetoric at Arizona rally",
    "slug": "trump-continues-his-dark-anti-immigrant-rhetoric-at-arizona-rally",
    "published_by": "From Veronica Stracqualursi and Alayna Treene in Prescott Valley, Arizona",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24287828672676.jpg?c=original",
    "metadata": "Former President Donald Trump speaks at a campaign rally in Prescott Valley, Arizona, on October 13.",
    "contents": [
      "Former President Donald Trump continued to escalate his dark and misleading rhetoric about Vice President Kamala Harris’ handling of illegal immigration and crime committed by migrants with remarks in Arizona on Sunday.",
      "Trump, speaking at a rally in Prescott Valley, said Harris has been bringing in criminals from “dungeons all over the world” and again made the baseless claim that migrants have come in from jails, prisons or mental health facilities.",
      "He argued that if Harris is elected president, “the entire country will be turned into a migrant camp.”",
      "The former president repeated his claim that foreign countries are “releasing their prison populations into our country” and accused Venezuela of busing in street criminals and drug lords into the US.",
      "In 2023, Trump campaign spokesperson Steven Cheung cited one source for the former president’s claim about prisons being emptied for migration purposes — an uncorroborated 2022 Breitbart article about a supposed federal intelligence report warning Border Patrol agents about freed violent prisoners from Venezuela who had then joined migrant caravans. Even if Venezuela had indeed freed prisoners to allow people to try to migrate to the US, that would be insufficient proof for Trump’s claim that some substantial number of Biden-era migrants are from prisons.",
      "Trump also aired a video during the rally about the Venezuelan gang Tren de Aragua, which he’s claimed has overrun Aurora, Colorado, and terrorized the community. The rumor, which Trump and his allies have helped spread, has been disputed by residents and by the city’s Republican mayor.",
      "CNN’s Daniel Dale contributed to this post."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm288a998001p3b6lc7q4g6cl\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Trump%20continues%20his%20dark%20anti-immigrant%20rhetoric%20at%20Arizona%20rally\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm288a998001p3b6lc7q4g6cl",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm288a998001p3b6lc7q4g6cl"
    },
    "completed": false
  },
  {
    "title": "Federal officials say there was no danger to Trump after man arrested with weapons near rally in California",
    "slug": "federal-officials-say-there-was-no-danger-to-trump-after-man-arrested-with-weapons-near-rally-in-california",
    "published_by": "From CNN’s Michelle Watson, Rashard Rose and Holmes Lybrand",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/2024-10-13t010711z-414454912-rc2cjaagngg8-rtrmadp-3-usa-election-trump.jpg?c=original",
    "metadata": "Former President Donald Trump speaks at a rally in Coachella, California, on October 12.",
    "contents": [
      "Two federal officials told CNN there is no evidence at this time to indicate a man who was arrested on gun charges near Donald Trump’s Saturday rally in California was attempting to assassinate the former president.",
      "In a joint statement with the FBI and Justice Department, the US Secret Service said that “former President Trump was not in any danger” at the rally.",
      "The man, who authorities say was illegally possessing a shotgun, a loaded handgun and a high-capacity magazine, was able to gain access to an initial perimeter near the rally in Coachella, Riverside County Sheriff Chad Bianco said Sunday.",
      "Once the man, identified by the sheriff as 49-year-old Vem Miller of Las Vegas, made it to the second perimeter, authorities realized some “irregularities,” Bianco said. The interior of the car was in disarray, the vehicle was unregistered, and it had a fake license plate, according to Bianco.",
      "Miller was in possession of multiple driver’s licenses and passports with different names, according to Bianco. It is unclear why Miller was in the area, according to Bianco, who said Miller claimed to be a journalist to gain entry to the rally.",
      "Miller was taken into custody before Trump’s rally and charged with firearms offenses. He was later released on a $5,000 bail, according to the sheriff’s office.",
      "CNN has repeatedly tried to reach Miller for comment. He is expected to appear in court on January 2, according to jail records.",
      "Trump’s campaign thanked law enforcement on Sunday.",
      "“We thank law enforcement for securing the rally site and helping ensure the safety of President Trump. We are aware of news reports about the arrest and are currently monitoring the situation and gathering more information,” Trump campaign spokesperson Steven Cheung told CNN.",
      "This post and headline have been updated with additional information."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm286jose001c3b6lg0jlxhu8\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EFederal%20officials%20say%20there%20was%20no%20danger%20to%20Trump%20after%20man%20arrested%20with%20weapons%20near%20rally%20in%20California%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm286jose001c3b6lg0jlxhu8",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm286jose001c3b6lg0jlxhu8"
    },
    "completed": false
  },
  {
    "title": "Harris again hits Trump over hurricane misinformation during North Carolina rally",
    "slug": "harris-again-hits-trump-over-hurricane-misinformation-during-north-carolina-rally",
    "published_by": "From CNN's Ebony Davis in Greenville, North Carolina",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Vice President Kamala Harris again railed against former President Donald Trump for spreading disinformation amid response and recovery efforts in the aftermath of recent hurricanes that caused massive devastation in the Southeast.",
      "“We can already see the harm he’s up to as a candidate. Most recently, spreading disinformation in the wake of natural disasters … Donald Trump cares more about scaring people, creating fear, running on a problem instead of what real leaders do, which is to participate in fixing problems,” Harris said at a rally in Greenville, North Carolina.",
      "Harris has criticized Trump after he repeatedly falsely claimed, without evidence, that the White House is diverting disaster relief aid to unrelated migrant programs. Trump has also repeatedly criticized the Biden administration’s response to Hurricane Helene, including falsely saying that the president wasn’t picking up calls and that there is an anti-Republican bias in how President Joe Biden and Harris are responding to the crisis.",
      "“As president of the United States, I will be focused each and every day on solving problems that affect you and your family,” Harris said.",
      "Before beginning her remarks, Harris offered prayers to those affected by the recent storms. In North Carolina, more than 100 deaths have been recorded since Helene struck last month. The storm killed at least 231 people across six states.",
      "“I was here eight days ago in the aftermath of Hurricane Helene, and since then, of course, another powerful storm, Hurricane Milton, cut a path of destruction through Florida,” Harris said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm2868seg000t3b6l7qvfdaag\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Harris%20again%20hits%20Trump%20over%20hurricane%20misinformation%20during%20North%20Carolina%20rally\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm2868seg000t3b6l7qvfdaag",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm2868seg000t3b6l7qvfdaag"
    },
    "completed": false
  },
  {
    "title": "Harris hits Trump for “not being transparent” with voters during North Carolina rally",
    "slug": "harris-hits-trump-for-not-being-transparent-with-voters-during-north-carolina-rally",
    "published_by": "From CNN's Ebony Davis in Greenville, North Carolina",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/2024-10-13t220042z-1150771135-rc2xjaal0z0w-rtrmadp-3-usa-election-harris.jpg?c=original",
    "metadata": "Vice President Kamala Harris speaks at a campaign rally in Greenville, North Carolina, on October 13.",
    "contents": [
      "Vice President Kamala Harris on Sunday blasted former President Donald Trump for “not being transparent” with voters as she hit him for withholding his medical records, backing out of a previously scheduled “60 Minutes” interview and declining an invitation to participate in another presidential debate.",
      "“Here’s the thing: It makes you wonder. It makes you wonder. Why does his staff want him to hide away? One must question, are they afraid that people will see that he is too weak and unstable?” she asked.",
      "Harris’ criticism of the former president comes a day after the White House released a medical summary stating that she is in “excellent health,” while Trump has yet to release his records. Trump also declined to participate in a CBS “60 Minutes” interview last week, in addition to ruling out another presidential debate with Harris."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm285paui000l3b6lf5i0adti\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20hits%20Trump%20for%20%E2%80%9Cnot%20being%20transparent%E2%80%9D%20with%20voters%20during%20North%20Carolina%20rally%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm285paui000l3b6lf5i0adti",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm285paui000l3b6lf5i0adti"
    },
    "completed": false
  },
  {
    "title": "Trump announces plan to expand Border Patrol during Arizona rally remarks",
    "slug": "trump-announces-plan-to-expand-border-patrol-during-arizona-rally-remarks",
    "published_by": "From CNN's Veronica Stracqualursi and Alayna Treene in Prescott Valley, Arizona",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1831288943.jpg?c=original",
    "metadata": "Border patrol agents lead migrants who entered the US illegally to a port of entry in Jacumba, California, on December 6, 2023.",
    "contents": [
      "Donald Trump on Sunday announced a plan to expand the Border Patrol if reelected during remarks at a rally in Prescott Valley, Arizona.",
      "The former president committed to a goal of hiring 10,000 new agents, providing a 10% raise, and a $10,000 retention and signing bonus, “because they haven’t been treated right.”",
      "He called on Congress to “immediately” approve the 10% raise for all agents. He suggested that Border Patrol agents have good genes. Trump recently said migrants who commit crimes have “bad genes.”",
      "Members of the National Border Patrol Council, a union that represents Border Patrol agents, were brought onstage. The group officially endorsed Trump Sunday, and the campaign touted the union’s endorsement on screens at the rally and in a news release blasted out during the event. The majority of Trump’s speech at the Findlay Toyota Center has been focused on immigration.",
      "Some context: Trump is hoping immigration will decide the race, all but staking his campaign on convincing Americans that closing the border and kicking out those who illegally crossed it are the most pressing priorities for the country. It’s a pitch he has delivered with increasingly dark and offensive rhetoric that leans into stereotypes of foreigners from poorer countries.",
      "This post and headline have been updated with additional developments."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm280hdvb001m3b6mkblqifbw\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20announces%20plan%20to%20expand%20Border%20Patrol%20during%20Arizona%20rally%20remarks%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm280hdvb001m3b6mkblqifbw",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm280hdvb001m3b6mkblqifbw"
    },
    "completed": false
  },
  {
    "title": "Michigan Gov. Whitmer apologizes for social media video following backlash from Catholic bishops",
    "slug": "michigan-gov-whitmer-apologizes-for-social-media-video-following-backlashfrom-catholic-bishops",
    "published_by": "From CNN's Ali Main",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/01-gettyimages-1487548850.JPG?c=original",
    "metadata": "Michigan Gov. Gretchen Whitmer delivers remarks at a summit in National Harbor, Maryland, on May 4, 2023.",
    "contents": [
      "Michigan Gov. Gretchen Whitmer apologized for how a social media video she appeared in was “construed” by Catholic bishops in the state.",
      "The Democratic governor was featured in a video on journalist and creator Liz Plank’s Instagram page featuring Plank eating a Doritos chip placed in her mouth by Whitmer.",
      "The video was meant to promote the bipartisan CHIPS Act, which provided funding for microchip manufacturing in the US and has been a key calling card of the Biden administration as Vice President Kamala Harris looks to win battleground Michigan in November.",
      "“Chips aren’t just delicious, the CHIPS Act is a game changer for US tech and manufacturing, boosting domestic production of semiconductors to reduce reliance on foreign suppliers,” Plank wrote in the caption, adding that electing former President Donald Trump would “put that at risk.”",
      "A group representing Michigan’s Catholic bishops took issue with the post, calling it an “all-too-familiar example of an elected official mocking religious persons and their practices.”",
      "“The skit goes further than the viral online trend that inspired it, specifically imitating the posture and gestures of Catholics receiving the Holy Eucharist, in which we believe that Jesus Christ is truly present,” said Paul A. Long, president and CEO of Michigan Catholic Conference.",
      "Whitmer said she did not intend to mock Catholic practices, writing in a statement, “over 25 years in public service, I would never do something to denigrate someone’s faith.” She noted her team has spoken to the Michigan Catholic Conference.",
      "“What was supposed to be a video about the importance of the CHIPS Act to Michigan jobs, has been construed as something it was never intended to be, and I apologize for that,” she said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm285dlgo00003b6lkwhtl17u\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EMichigan%20Gov.%20Whitmer%20apologizes%20for%20social%20media%20video%20following%20backlash%C2%A0from%20Catholic%20bishops%C2%A0%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm285dlgo00003b6lkwhtl17u",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm285dlgo00003b6lkwhtl17u"
    },
    "completed": false
  },
  {
    "title": "As Harris makes case for presidency, her record as a prosecutor draws fresh scrutiny",
    "slug": "as-harris-makes-case-for-presidency-her-record-as-a-prosecutor-draws-fresh-scrutiny",
    "published_by": "From CNN's Scott Glover, Curt Devine, Kyung Lah and Daniel Medina",
    "thumb": "",
    "metadata": "",
    "contents": [
      "As attorney general of California, Vice President Kamala Harris advocated for enforcement of a state law under which the parents of chronically truant kids could be thrown in jail. But years later, during her first campaign for president, she expressed regret that some prosecutors had actually done so, saying that “that was never was the intention” of the law.",
      "Her shifting stance on the contentious topic is but one example of how the Democratic presidential nominee has attempted to walk the line between tough-on-crime prosecutor and progressive politician.",
      "Following the controversial police killing of Michael Brown in Ferguson, Missouri, in 2014, Harris launched a pilot program requiring field special agents of the California Department of Justice to begin wearing body cameras. She declined, however, to back a far more comprehensive measure favored by police reform advocates that would have provided statewide regulations on the devices.",
      "About six years later, following the police murder of George Floyd in Minneapolis, Harris noted the importance of “independent investigations” into alleged police misconduct, citing the inherent problem of perceived or real conflicts of interest when such cases are investigated by local prosecutors. As California’s AG, however, she declined to provide that sort of outside scrutiny to several controversial police shootings in the state.",
      "Her critics have seized on these and other perceived contradictions as evidence that she’s a flip-flopping politician — “a chameleon” as Republican vice presidential nominee Sen. JD Vance has repeatedly called her. But Harris’ supporters see her as an opened-minded leader unafraid to change her thinking when persuaded by evidence.",
      "Read more about Harris’ history as a prosecutor here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27vx08800053b6manoib9ek\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=As%20Harris%20makes%20case%20for%20presidency%2C%20her%20record%20as%20a%20prosecutor%20draws%20fresh%20scrutiny\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27vx08800053b6manoib9ek",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27vx08800053b6manoib9ek"
    },
    "completed": false
  },
  {
    "title": "Man arrested with illegally possessed weapons near Trump rally Saturday",
    "slug": "man-arrested-with-illegally-possessed-weapons-near-trump-rally-saturday",
    "published_by": "From CNN's Rashard Rose",
    "thumb": "",
    "metadata": "",
    "contents": [
      "A man illegally possessing a shotgun, a loaded handgun, and a high-capacity magazine was arrested Saturday near former President Donald Trump’s rally in Coachella, California, the Riverside County Sheriff’s Office said Sunday.",
      "Vem Miller, 49, of Las Vegas, was arrested just before 5 p.m. PT after deputies assigned to the rally found him in a black SUV at a checkpoint near the rally, the sheriff’s office said in a statement.",
      "“Miller was taken into custody without incident and later booked at the John J. Benoit Detention Center for possession of a loaded firearm and possession of a high-capacity magazine,” the statement said.",
      "The sheriff’s office added that the “incident did not impact the safety of former President Trump or attendees of the event.”",
      "Miller was released on a $5,000 bail, according to the Riverside County Inmate Information System.",
      "The sheriff’s department is asking anyone with information to contact the Palm Desert Sheriff’s Station.",
      "CNN has reached out to the Trump campaign and the US Secret Service for comment.",
      "The Riverside County Sheriff’s Office is expected to hold a news conference Sunday at 6 p.m. ET."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm280urdl00003b6np0h1lubx\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EMan%20arrested%20with%20illegally%20possessed%20weapons%20near%20Trump%20rally%20Saturday%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm280urdl00003b6np0h1lubx",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm280urdl00003b6np0h1lubx"
    },
    "completed": false
  },
  {
    "title": "National CNN Poll of Polls continues to show no clear leader in presidential race",
    "slug": "national-cnn-poll-of-polls-continues-to-show-no-clear-leader-in-presidential-race",
    "published_by": "From CNN's Ariel Edwards-Levy",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/20241004-trump-harris-split-100424.jpg?c=original",
    "metadata": "Former President Donald Trump and Vice President Kamala Harris.",
    "contents": [
      "A new CNN Poll of Polls average of national polling released Sunday morning finds no clear leader in the presidential race, with an average of 50% of likely voters supporting Vice President Kamala Harris and 47% backing former President Donald Trump.",
      "The latest average incorporates a new ABC News/Ipsos poll, which finds Harris at 50% to Trump’s 48% among likely voters when third-party candidates are included, and a new CBS News/YouGov poll, which finds Harris at 51% to Trump’s 48% in a head-to-head matchup among likely voters.",
      "An NBC News poll also released Sunday finds Trump taking 47% to Harris’ 46% in a multi-way ballot test among registered voters, with the two candidates taking 48% each in a head-to-head matchup. The NBC poll did not release results among likely voters, but it does envision several different turnout scenarios that could shift the race in either direction. Under either a more favorable Republican or Democratic turnout scenario, NBC finds that the race between Harris and Trump remains within a 3-point margin nationally.",
      "This post has been updated with additional developments."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27jin8b000k3d5vrs3xkvah\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=National%20CNN%20Poll%20of%20Polls%20continues%20to%20show%20no%20clear%20leader%20in%20presidential%20race\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27jin8b000k3d5vrs3xkvah",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27jin8b000k3d5vrs3xkvah"
    },
    "completed": false
  },
  {
    "title": "Vance tells North Carolinians to vote while attending NASCAR race",
    "slug": "vance-tells-north-carolinians-to-vote-while-attending-nascar-race",
    "published_by": "From CNN's Ali Main in Concord, North Carolina",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2178251178.jpg?c=original",
    "metadata": "Republican vice presidential nominee JD Vance, right, speaks to #8 Lenovo Chevrolet driver Kyle Busch at Charlotte Motor Speedway in Concord, North Carolina, on October 13.",
    "contents": [
      "Republican presidential nominee JD Vance visited the Charlotte Motor Speedway on Sunday for a NASCAR race, where he encouraged North Carolinians to vote.",
      "Vance greeted supporters at the NASCAR racetrack in Concord and met with drivers, crews and owners, including owner Richard Childress.",
      "The Ohio senator encouraged people in North Carolina to “vote on November 5.”",
      "He was joined by his wife, Usha; his three children; Donald Trump’s eldest son, Donald Trump Jr.; and Republican National Committee Chairman Michael Whatley.",
      "Former race car driver Danica Patrick wrote on social media that she invited Vance to attend the race when she hosted a town hall with him in Greensboro, North Carolina, last week. Patrick said at the town hall that she is a first-time voter and is casting her ballot for Trump."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27wqock00003b6lhcok72qe\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20tells%20North%20Carolinians%20to%20vote%20while%20attending%20NASCAR%20race%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27wqock00003b6lhcok72qe",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27wqock00003b6lhcok72qe"
    },
    "completed": false
  },
  {
    "title": "Springfield Haitians weigh their future as Trump threatens deportations",
    "slug": "springfield-haitians-weigh-their-future-as-trump-threatens-deportations",
    "published_by": "From CNN's Omar Jimenez, Caitlin Stephen Hu and Matthew Reynard in Springfield, Ohio",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/videothumbnails/81590510-58898512-generated-thumbnail.jpg?c=original",
    "metadata": "Daniel Aula speaks to CNN.An aerial view of Springfield, Ohio.",
    "contents": [
      "While Haitian immigrant Daniel Aula has found opportunity in Springfield, Ohio, he’s also found himself in the middle of a bitter national debate on immigration heading into November’s election, fueled in this case largely by rumors and threats.",
      "The city of Springfield estimates there are between 12,000 and 15,000 immigrants living in Clark County, the county that holds Springfield, most of them believed to be Haitians arriving in just the past four years.",
      "The image of a city dramatically altered by immigration has been seized upon by former President Donald Trump and his running mate, Ohio Sen. JD Vance, who have made criticism of the Biden administration’s immigration policy a cornerstone of their campaign.",
      "Springfield is Aula’s chance at a new life. He’s taking English classes, but he’s had so much to learn, namely how to get a job. Many in Springfield have been eager to help him, and to hire him.",
      "Not long after he got to Springfield, Aula started working at Pentaflex, a company focused mainly on building metal stampings and assemblies for safety-related functions.",
      "CEO Ross McGregor, whose family has been involved in manufacturing here for decades, has nothing but praise for his Haitian employees. To lose them would be a blow to his business, he told CNN. McGregor hired his first Haitian worker “three, four years ago” not because he sought them out specifically but because he needed dependable workers.",
      "Still, many Haitian residents in Springfield live in fear of Trump’s threat of removal, unsure over their future and their safety.",
      "Read more here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27upmf2001n3b6mflqxypsq\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Springfield%20Haitians%20weigh%20their%20future%20as%20Trump%20threatens%20deportations\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27upmf2001n3b6mflqxypsq",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27upmf2001n3b6mflqxypsq"
    },
    "completed": false
  },
  {
    "title": "Democrats to fly Harris ads over NFL games in swing states",
    "slug": "democrats-to-fly-harris-ads-over-nfl-games-in-swing-states",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "",
    "metadata": "",
    "contents": [
      "The Democratic National Committee is flying campaign ads over NFL games in battleground states Sunday, as Vice President Kamala Harris seeks to bolster her standing with male voters.",
      "Ads will appear over the Pittsburgh Steelers-Las Vegas Raiders game in Nevada, the Arizona Cardinals-Green Bay Packers game in Wisconsin, the Atlanta Falcons-Carolina Panthers game in North Carolina, and the Cleveland Browns-Philadelphia Eagles game in Pennsylvania.",
      "The DNC’s flyover banners will read “Sack Trump’s Project 2025! Vote Kamala!” and “Go Birds! Sack Project 2025 Vote Kamala!”",
      "Democrats are seeking to tie Donald Trump to Project 2025, a closely aligned conservative group’s plans to radically reshape the federal government and American life should the former president win a second term.",
      "Trump has repeatedly sought to distance himself from the conservative group’s plans. In a July social media post, the former president said that he knew “nothing” about Project 2025 and that “some of the things they’re saying are absolutely ridiculous.”",
      "Some context: In the final weeks of the race, male voters are among the biggest persuasive targets for the Harris campaign as it seeks to erode part of Trump’s advantage by spending tens of millions in TV ads on Major League Baseball games, college football broadcasts and soccer matches in the top battleground states and beyond.",
      "While Harris and her running mate, Minnesota. Gov. Tim Walz, rarely discuss gender or the historic nature of her candidacy, the size of the gender gap may help decide the outcome of the November election. The campaign is working to “blow the ceiling off turnout among women,” one adviser previously told CNN, and “finding the gettable men.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27wgryv000b3b6mtlehs6qo\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EDemocrats%20to%20fly%20Harris%20ads%20over%20NFL%20games%20in%20swing%20states%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27wgryv000b3b6mtlehs6qo",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27wgryv000b3b6mtlehs6qo"
    },
    "completed": false
  },
  {
    "title": "Harris focuses on faith and unity during church service in North Carolina",
    "slug": "harris-focuses-on-faith-and-unity-during-church-service-in-north-carolina",
    "published_by": "From CNN's Ebony Davis in Greenville, North Carolina",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177514271.jpg?c=original",
    "metadata": "Vice President Kamala Harris speaks during a church service at the Koinonia Christian Center in Greenville, North Carolina, on October 13.Harris prays during the service.",
    "contents": [
      "Vice President Kamala Harris on Sunday delivered a message of faith and unity in the wake of hurricane response efforts during remarks at a church service in Greenville, North Carolina.",
      "As she addressed the predominantly Black congregation at the Koinonia Christian Center, Harris highlighted the “heroes” and “angels” who have aided in the aftermath of Hurricane Helene, which devastated parts of western North Carolina last month.",
      "Though she did not mention Donald Trump by name, the vice president again warned of spreading misinformation and inciting fear about hurricane response efforts.",
      "“There are some who are not acting in the spirit, and I am speaking of those who have been literally not telling the truth, lying about people who are working hard to help folks in need, spreading disinformation when the truth and facts are required,” Harris said.",
      "Harris wrapped her roughly 10-minute remarks with an encouraging tone, telling the  congregation, “Let us continue to look in the face of a stranger and see a neighbor.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27snrgr00053b6m4lhxqsvj\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20focuses%20on%20faith%20and%20unity%20during%20church%20service%20in%20North%20Carolina%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27snrgr00053b6m4lhxqsvj",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27snrgr00053b6m4lhxqsvj"
    },
    "completed": false
  },
  {
    "title": "Trump says he\u0026#39;ll appear on Joe Rogan\u0026#39;s podcast",
    "slug": "trump-says-he39ll-appear-on-joe-rogan39s-podcast",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Former President Donald Trump said in an interview with the Nelk Boys that he was going to appear on Joe Rogan’s podcast.",
      "Spotify says “The Joe Rogan Experience” is the second most-streamed podcast behind “Call Her Daddy,” which Vice President Kamala Harris recently appeared on.",
      "CNN has reached out to the Trump campaign for further details."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27vwtcw00003b6mie2be9cc\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20says%20he'll%20appear%20on%20Joe%20Rogan's%20podcast%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27vwtcw00003b6mie2be9cc",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27vwtcw00003b6mie2be9cc"
    },
    "completed": false
  },
  {
    "title": "Obama, DeNiro, Common and more famous \u0026#34;girl dads\u0026#34; issue open letter supporting Harris",
    "slug": "obama-deniro-common-and-more-famous-34girl-dads34-issue-open-letter-supporting-harris",
    "published_by": "From CNN's Elizabeth Wagmeister",
    "thumb": "",
    "metadata": "",
    "contents": [
      "A group of high-profile “girl dads” have issued an open letter in support of Vice President Kamala Harris to “fight for our daughter’s futures.”",
      "Former President Barack Obama is among the Hollywood and DC notables who signed the letter released Sunday, which is National Father-Daughter Day.",
      "The letter is addressed to “Girl Dads Across America.” Signatories include actors like Kevin Bacon, Courtney B. Vance, Robert DeNiro, Don Cheadle, Mark Hamill and Leslie Odom Jr; musicians such as Common and Lance Bass; Hollywood heavyweights like director JJ Abrams and producers Brad Falchuk and Will Packer; and politicians including Pete and Chasten Buttigieg, Maryland Gov. Wes Moore, second gentleman Doug Emhoff and Democratic vice presidential nominee Tim Walz.",
      "“Right now, we are at a crossroads in the fight for our daughters’ futures,” the letter states. “While Vice President Harris is fighting for a better, brighter future — in what she calls a “New Way Forward” — for our kids, Donald Trump has a Project 2025 blueprint that would give him total control over our daily lives and futures.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27v5so100053b6nkq7hb1d1\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EObama%2C%20DeNiro%2C%20Common%20and%20more%20famous%20%22girl%20dads%22%20issue%20open%20letter%20supporting%20Harris%20%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27v5so100053b6nkq7hb1d1",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27v5so100053b6nkq7hb1d1"
    },
    "completed": false
  },
  {
    "title": "House Republicans attempt to avoid 2022 letdown with new tactic on abortion: \u0026#34;We’re both pro-choice\u0026#34;",
    "slug": "house-republicans-attempt-to-avoid-2022-letdown-with-new-tactic-on-abortion-34were-both-pro-choice34",
    "published_by": "From CNN's Sarah Ferris, Manu Raju and Michelle Shen",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Republicans in the nation’s toughest House districts are making a major pivot on abortion with a surprising result — they’re starting to sound like Democrats.",
      "GOP candidates in suburbs of places like Tucson, Des Moines and Syracuse are going public with vows never to criminalize abortion or support a national ban. Some are going further: Rep. John Duarte of California’s Central Valley, Rep. Tom Kean Jr. in northern New Jersey and GOP candidate Matt Gunderson in the San Diego area have all described themselves as “pro choice” — with the latter even speaking directly to the camera in his first TV ad and borrowing Bill Clinton’s phrase calling for the procedure to be “safe, legal and rare.”",
      "In this fall’s toss-up battle for the House, swing-seat Republicans are carefully rebranding themselves on abortion after largely failing to respond to relentless Democratic attacks that cost the GOP big last cycle. And they’re attempting to neutralize the Democrats’ most potent attack — all in an effort to turn voters’ attention to the US-Mexico border and other galvanizing issues.",
      "It may be easier said than done. Even as swing-seat Republicans attempt to paint a more nuanced view of the GOP’s stance on abortion, the national party has often muddled that message. In recent days, former first lady Melania Trump disclosed she supports the right to an abortion “free from any intervention” — while Donald Trump’s running mate, Sen. J.D. Vance of Ohio, took the staunchly conservative position of vowing to defund Planned Parenthood.",
      "And it all underscores a critical weakness for the GOP fewer than 30 days from the election. The party still struggles to respond to an issue that makes up the vast majority of Democratic attacks this cycle: 80% of spending on TV ads by the House Democrats’ two main groups went to ads focusing on abortion. And it’s been particularly effective against GOP incumbents with well-documented comments on abortion — like Rep. Zach Nunn of Iowa — that Democrats have turned into attack ads.",
      "Read more about some Republicans’ attempt to win over pro-choice voters here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ukypx000n3b6lu1fpfplo\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=House%20Republicans%20attempt%20to%20avoid%202022%20letdown%20with%20new%20tactic%20on%20abortion%3A%20%22We%E2%80%99re%20both%20pro-choice%22\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ukypx000n3b6lu1fpfplo",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27ukypx000n3b6lu1fpfplo"
    },
    "completed": false
  },
  {
    "title": "Vance says history suggests Trump won\u0026#39;t go after political opponents",
    "slug": "vance-says-history-suggests-trump-won39t-go-after-political-opponents",
    "published_by": "From CNN's Kit Maher",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24286822433116.jpg?c=original",
    "metadata": "Republican vice presidential nominee JD Vance speaks during a campaign town hall in Reading, Pennsylvania, on October 12.",
    "contents": [
      "Republican vice presidential nominee JD Vance said Sunday that history suggests former President Donald Trump won’t go after his political opponents if he is elected while baselessly  accusing Vice President Kamala Harris of targeting her own political opponents.",
      "As CNN previously reported, Trump has threatened prosecution and “long-term prison sentences” for election officials and political operatives, who he suggested could cheat in the 2024 election.",
      "“He said that people who violated our election laws will be prosecuted. I think that’s the administration of law. He didn’t say, ‘People are going to go to jail because they disagree with me,’” Vance said.",
      "The Ohio senator again refused to say Trump lost the 2020 election: “I’ve been asked this question 10 times in the past couple of weeks. Of course, Donald Trump and I believe there were problems in 2020. … I believe that in 2020, when Big Tech firms were censoring American citizens, that created very serious problems.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27trtjm00003b6lfxaz2j1h\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20says%20history%20suggests%20Trump%20won't%20go%20after%20political%20opponents%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27trtjm00003b6lfxaz2j1h",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27trtjm00003b6lfxaz2j1h"
    },
    "completed": false
  },
  {
    "title": "Bill Clinton says Trump\u0026#39;s loyalty demands are not \u0026#34;consistent with the scripture\u0026#34;",
    "slug": "bill-clinton-says-trump39s-loyalty-demands-are-not-34consistent-with-the-scripture34",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177506952.jpg?c=original",
    "metadata": "Former President Bill Clinton speaks to the congregation at Mount Zion Baptist Church in Albany, Georgia, on October 13.",
    "contents": [
      "Former President Bill Clinton on Sunday criticized former President Donald Trump for prioritizing “absolute, total loyalty” from fellow Republican officials and voters, suggesting during remarks at a Baptist church in Georgia that Trump’s actions are not “consistent with the scripture.”",
      "Trump, Clinton said, has demanded that those close to him act as yes-men, and argued the only person who merits “total loyalty” is Jesus Christ.",
      "The remarks mark Clinton’s first stop out on to the campaign trail for Vice President Kamala Harris after praising her candidacy at the Democratic National Convention in August. Throughout the speech, he advocated for Harris’ policies on the economy, health care and housing and made forceful arguments urging Georgia voters to vote early and head to the polls, even if they’re undecided."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27tfyqv00003d5v9oafo6o5\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EBill%20Clinton%20says%20Trump's%20loyalty%20demands%20are%20not%20%22consistent%20with%20the%20scripture%22%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27tfyqv00003d5v9oafo6o5",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27tfyqv00003d5v9oafo6o5"
    },
    "completed": false
  },
  {
    "title": "Former Rep. Liz Cheney sounds alarm over measures loyalists in Congress may take for Trump",
    "slug": "former-rep-liz-cheney-sounds-alarm-over-measures-loyalists-in-congress-may-take-for-trump",
    "published_by": "From CNN’s Mina Allen",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24277855155035.jpg?c=original",
    "metadata": "Former Congresswoman Liz Cheney speaks at a campaign event for Kamala Harris in Ripon, Wisconsin, on October 3.",
    "contents": [
      "Republican former Rep. Liz Cheney said Sunday there was not “a peaceful transfer of power” between the Trump and Biden administrations, raising concerns over the lengths Trump loyalists in Congress may go for the former president.",
      "“I do not have faith that Mike Johnson will fulfill his constitutional obligations,” Cheney said on NBC’s “Meet the Press,” adding that House Speaker Mike Johnson has a record of taking actions on certain things despite knowing he is in the wrong. She warned that it is very important Republicans are not the majority in the House.",
      "Cheney also said Donald Trump’s “cruelty” is what makes him unfit to serve as president. She once again slammed Trump’s actions on January 6, 2021, and criticized his recent spread of misinformation regarding the federal response to Hurricane Helene.",
      "Some background: Earlier this month, Cheney announced in a joint appearance with Kamala Harris in Wisconsin that she is “proudly” casting her vote for the Democratic presidential nominee. She pointed toward Trump’s actions on January 6, declaring that anyone “who would do these things can never be trusted with power again.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27qq0ry000y3b6me92ydk9p\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EFormer%20Rep.%20Liz%20Cheney%20sounds%20alarm%20over%20measures%20loyalists%20in%20Congress%20may%20take%20for%20Trump%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27qq0ry000y3b6me92ydk9p",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27qq0ry000y3b6me92ydk9p"
    },
    "completed": false
  },
  {
    "title": "Harris and Walz to spread across \u0026#34;blue wall\u0026#34; states this week",
    "slug": "harris-andwalzto-spread-across-34blue-wall34-states-this-week",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2168167310.jpg?c=original",
    "metadata": "Vice President Kamala Harris and Minnesota Gov. Tim Walz disembark from their campaign bus in Savannah, Georgia, on August 28.",
    "contents": [
      "Vice President Kamala Harris and Minnesota Gov. Tim Walz will spread across the Midwestern battleground states this week, traveling to Pennsylvania, Wisconsin and Michigan, a campaign official told CNN.",
      "The visits include a Tuesday trip by Harris to Michigan, where she’ll meet with Black entrepreneurs in Detroit and attend an event alongside radio host Charlamagne tha God. That same day, Walz will make a stop in Butler, Pennsylvania, the site of an assassination attempt on former President Donald Trump in July.",
      "Joining Harris and Walz on the campaign trail this week will be former President Barack Obama, who will make stops in Arizona on Friday and travel to Nevada on Saturday for the first day of early voting.",
      "Here’s the campaign’s schedule:",
      "Harris:",
      "Walz:"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27s6hyu00003b6m7yfjahwr\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EHarris%20and%C2%A0Walz%C2%A0to%20spread%20across%20%22blue%20wall%22%20states%20this%20week%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27s6hyu00003b6m7yfjahwr",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27s6hyu00003b6m7yfjahwr"
    },
    "completed": false
  },
  {
    "title": "Trump claims any \u0026#34;problem\u0026#34; on Election Day will be from \u0026#34;enemy from within\u0026#34;",
    "slug": "trump-claims-any-34problem34-on-election-day-will-be-from-34enemy-from-within34",
    "published_by": "From CNN's Veronica Stracqualursi and Sam Fossum",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24285725425068.jpg?c=original",
    "metadata": "Former President Donald Trump arrives for a campaign rally on October 11, in Aurora, Colorado.",
    "contents": [
      "Former President Donald Trump said that he isn’t expecting chaos from his supporters or foreign actors on Election Day, but argued that the larger “problem” is the “enemy from within” and “radical left lunatics.”",
      "In an interview with Fox News’ Maria Bartiromo, Trump was asked whether he expects “chaos” on Election Day in the wake of the Justice Department arresting and charging an Afghan national for allegedly plotting a terrorist attack in the US on Election Day.",
      "“No, I don’t think — not from the side that votes for Trump,” the former president said in an interview that aired Sunday on “Sunday Morning Futures.”",
      "Trump, whose supporters stormed the Capitol building on January 6, 2021, in an attempt to thwart Congress’ certification of his 2020 election loss, argued that the larger threat on Election Day is the “sick people” within the country.",
      "“And I think it should be very easily handled by, if necessary, by National Guard, or if really necessary by the military, because they can’t let that happen,” he added.",
      "Vice President Kamala Harris’ campaign on Sunday condemned Trump’s comments about deploying the National Guard against people in the country, saying that they should “alarm every American.”",
      "This post has been updated with remarks from the Harris campaign."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27qxp0f00003d5v0cg17g4y\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20claims%20any%20%22problem%22%20on%20Election%20Day%20will%20be%20from%20%22enemy%20from%20within%22%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27qxp0f00003d5v0cg17g4y",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27qxp0f00003d5v0cg17g4y"
    },
    "completed": false
  },
  {
    "title": "Sen. Warnock seeks to temper concerns over Black male support for Harris",
    "slug": "sen-warnock-seeks-to-temper-concerns-over-black-male-support-for-harris",
    "published_by": "From CNN's Max Rego",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/2024-03-09t222455z-235921579-rc2li6aodxh0-rtrmadp-3-usa-election-biden.JPG?c=original",
    "metadata": "Sen. Raphael Warnock speaks in Atlanta on March 9.",
    "contents": [
      "Democratic Sen. Raphael Warnock of Georgia on Sunday emphasized that he is not concerned about Vice President Kamala Harris’ support among Black men.",
      "Former President Barack Obama addressed Black men specifically during a Thursday stop at a Harris campaign office in Pittsburgh, saying: “You’re thinking about sitting out or supporting (Trump), who has a history of denigrating you, because you think that’s a sign of strength, because that’s what being man is? Putting women down? That’s not acceptable.”",
      "Warnock, who mentioned his “great deal of respect” for Obama, implored Black men to see the “stark contrast” between the two candidates.",
      "CNN’s Dana Bash reported the Harris campaign will unveil a set of new policy proposals early this week aimed at appealing to Black male voters, according to a campaign source.",
      "The details of the proposals aren’t yet clear but recent polls have highlighted Harris’ need to build more support among Black voters, as she lags behind President Joe Biden’s numbers in 2020."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o8mpd000k3b6mygxobd2k\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ESen.%20Warnock%20seeks%20to%20temper%20concerns%20over%20Black%20male%20support%20for%20Harris%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o8mpd000k3b6mygxobd2k",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27o8mpd000k3b6mygxobd2k"
    },
    "completed": false
  },
  {
    "title": "Vance says Republicans “don\u0026#39;t want taxpayer funding for abortions”",
    "slug": "vance-says-republicans-don39t-want-taxpayer-funding-for-abortions",
    "published_by": "From CNN's Kit Maher",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24286726791847.jpg?c=original",
    "metadata": "Sen. JD Vance speaks at a campaign event on October 12, in Johnstown, Pennsylvania.",
    "contents": [
      "GOP vice presidential candidate JD Vance said Sunday that Republicans “don’t want taxpayer funding for abortions” when asked whether former President Donald Trump supports defunding Planned Parenthood.",
      "“That’s been the policy, not just to the Republican Party, by the way, but even a lot of Democrats who are pro-choice, who want wide access to abortion, will say: ‘We don’t think taxpayers should be funding this stuff,;” Vance continued. “That bipartisan consensus is something President Trump very much supports.”",
      "The Hyde Amendment bars the use federal funding for abortion except in the cases of rape, incest or the life of the mother.",
      "As a fact-sheet from Planned Parenthood explains, “The policy is not a permanent law but is attached to the Congressional appropriations bill for the Department of Health and Human Services and has been renewed annually by Congress.”",
      "During his 2022 Senate run, Vance expressed support for a 15-week abortion ban and said he would support abortion becoming “illegal nationally” but Vance reiterated on Sunday that Trump does not support a federal ban on abortion."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27nigvs00053b6mnszr3dp9\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EVance%20says%20Republicans%20%E2%80%9Cdon't%20want%20taxpayer%20funding%20for%20abortions%E2%80%9D%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27nigvs00053b6mnszr3dp9",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27nigvs00053b6mnszr3dp9"
    },
    "completed": false
  },
  {
    "title": "Clyburn says he\u0026#39;s \u0026#34;concerned\u0026#34; about Black men staying home for election",
    "slug": "clyburn-says-he39s-34concerned34-about-black-men-staying-home-for-election",
    "published_by": "From CNN's Dana Bash and Aileen Graef",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2166800069.jpg?c=original",
    "metadata": "Rep. Jim Clyburn speaks at the Democratic National Convention in Chicago on August 19.",
    "contents": [
      "Rep. Jim Clyburn, one of the top Black leaders in the Democratic party, said Sunday that while he is “concerned” about the turnout of Black men in the election, he is still “energetic” as he has conversations with Black voters about their concerns.",
      "The Harris campaign will unveil a set of new policy proposals early this week aimed at appealing to Black male voters, according to a campaign source.",
      "The details of the proposals aren’t yet clear, but recent polls have highlighted Vice President Kamala Harris’ need to build more support among Black voters, as she lags behind President Joe Biden’s numbers in 2020. Last week, former President Barack Obama admonished Black men who are hesitating to back Harris’ presidential campaign, telling them it’s “not acceptable” to sit out this election and suggesting they might be reluctant to vote for Harris because she’s a woman.",
      "Clyburn downplayed recent polls, saying he has had “direct and frank discussions” with Black men while on the campaign trail and does not think polls reflect what he is seeing."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27nuc4m00003d5v274uzv3y\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EClyburn%20says%20he's%20%22concerned%22%20about%20Black%20men%20staying%20home%20for%20election%20%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27nuc4m00003d5v274uzv3y",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27nuc4m00003d5v274uzv3y"
    },
    "completed": false
  },
  {
    "title": "Rep. Donalds addresses hurricane damage, California wildfire funding after Trump comments",
    "slug": "rep-donalds-addresses-hurricane-damage-california-wildfire-funding-after-trump-comments",
    "published_by": "From CNN's Sarah Davis",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Republican Rep. Byron Donalds, who represents southwest Florida, said Sunday his district is rebuilding after back-to-back hurricanes left a trail of destruction in the state.",
      "While federal and local relief efforts are still underway in Florida, former President Donald Trump sparked controversy at a rally in California on Saturday evening when he threatened to withhold federal aid for future forest fires if the state did not change its environmental regulations.",
      "Donalds reiterated some of Trump’s attacks, saying California needs to “do the simple work of clearing underbrush” to mitigate forest fire risks. But he stopped short of advocating for a complete blockage of federal aid to the state.",
      "“We’re always going to be there for the American people — make no mistake about that — but California does need to clean up their lands,” Donalds said."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27lnsts00003b6n8ln3tt4o\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Rep.%20Donalds%20addresses%20hurricane%20damage%2C%20California%20wildfire%20funding%20after%20Trump%20comments\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27lnsts00003b6n8ln3tt4o",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27lnsts00003b6n8ln3tt4o"
    },
    "completed": false
  },
  {
    "title": "Vance dismisses Colorado mayor who called Trump\u0026#39;s gang claims \u0026#34;grossly exaggerated\u0026#34;",
    "slug": "vance-dismisses-colorado-mayor-who-called-trump39s-gang-claims-34grossly-exaggerated34",
    "published_by": "From CNN's Kit Maher",
    "thumb": "",
    "metadata": "",
    "contents": [
      "Republican vice presidential candidate JD Vance on Sunday defended former President Donald Trump’s claims about Colorado towns being “invaded and conquered” by Venezuelan gangs and dismissed the mayor of Aurora’s assertion that Trump’s claims were “grossly exaggerated.”",
      "Ahead of Trump’s visit to Aurora, mayor Mike Coffman issued a statement saying, “The reality is that the concerns about Venezuelan gang activity have been grossly exaggerated. The incidents were limited to several apartment complexes in this city of more than 400,000 residents.”",
      "Trump has all but staked his presidential campaign on convincing Americans that closing the border and kicking out those who illegally crossed it are the most pressing priorities for the country. It’s a pitch he has delivered with increasingly dark and offensive rhetoric that leans into stereotypes of foreigners from poorer countries.",
      "Trump has claimed — over the repeated objections of state and local leaders, including from his own party — that Haitian migrants living in Springfield, Ohio, are “eating the pets” of the local residents. To the residents in a tiny Wisconsin town, he warned against what people from all over the world were “doing to the fabric, to the guts of our country.” Last week, Trump espoused nativist arguments about some immigrants having “bad genes,” which cause them to commit crimes."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o97hg000h3d5vfemm4qw1\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Vance%20dismisses%20Colorado%20mayor%20who%20called%20Trump's%20gang%20claims%20%22grossly%20exaggerated%22\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o97hg000h3d5vfemm4qw1",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27o97hg000h3d5vfemm4qw1"
    },
    "completed": false
  },
  {
    "title": "Walz calls concerns over stricter gun laws a \u0026#34;red herring issue\u0026#34;",
    "slug": "walz-calls-concerns-over-stricter-gun-laws-a-34red-herring-issue34",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2175520631.jpg?c=original",
    "metadata": "Minnesota Gov. Tim Walz speaks during a rally in York, Pennsylvania, on October 2.",
    "contents": [
      "Minnesota Gov. Tim Walz defended Vice President Kamala Harris’ position on stricter gun safety laws from concerns over violations of the Second Amendment, calling it a “red herring issue” while reaffirming his support for the constitutional right to bear arms.",
      "When asked about Harris’ previous support for a mandatory gun buy-back program in an interview with Fox News on Sunday, Walz said “no one’s coming for your guns” but advocated for stronger background checks, so-called red-flag laws, or mandatory trigger locks to reduce incidents of gun violence, particularly emphasizing the importance of reducing school shootings.",
      "“No one’s coming for your guns. I continue to buy them. The vice president is a gun owner. So many of your viewers are, but they also are concerned that we don’t need to see our children shot in schools,” he added.",
      "The interview comes a day after Walz went pheasant hunting in rural Minnesota, where he carried a shotgun, although he did not have the chance to fire his gun."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o441q00063d5vzotum721\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3EWalz%20calls%20concerns%20over%20stricter%20gun%20laws%20a%20%22red%20herring%20issue%22%C2%A0%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27o441q00063d5vzotum721",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27o441q00063d5vzotum721"
    },
    "completed": false
  },
  {
    "title": "Speaker Johnson says Trump\u0026#39;s \u0026#34;health is on display\u0026#34;",
    "slug": "speaker-johnson-says-trump39s-34health-is-on-display34",
    "published_by": "From CNN's Sam Fossum",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2173410674.jpg?c=original",
    "metadata": "House Speaker Mike Johnson speaks in Washington, DC, on September 24.",
    "contents": [
      "House Speaker Mike Johnson on Sunday weighed in on former President Donald Trump’s health records, saying he doesn’t believe Trump needs to provide further details after Vice President Kamala Harris released a letter from her White House doctor on Saturday.",
      "The Trump campaign released a statement about the former president’s medical records on Saturday, stating he has “voluntarily released updates from his personal physician, as well as detailed reports from Dr. Ronny Jackson who treated him after the first assassination attempt. All have concluded he is in perfect and excellent health to be Commander in Chief.”",
      "On the critical issue of abortion rights, Johnson said there is no consensus in Congress to pass federal legislation and indicated he likely wouldn’t bring such a bill up for a vote if Republicans keep the House and he stays on as speaker after the 2024 election.",
      "When asked whether he would certify the election regardless of who wins in November, Johnson said he would as long as the election is “free and fair.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ni9n600003b6mqtke7szh\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Speaker%20Johnson%20says%20Trump's%20%22health%20is%20on%20display%22\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27ni9n600003b6mqtke7szh",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27ni9n600003b6mqtke7szh"
    },
    "completed": false
  },
  {
    "title": "Republican Party and Detroit officials settle poll-watcher lawsuit",
    "slug": "republican-party-and-detroit-officials-settle-poll-watcher-lawsuit",
    "published_by": "From CNN's Marshall Cohen",
    "thumb": "",
    "metadata": "",
    "contents": [
      "The Republican National Committee and the city of Detroit reached a settlement Friday to resolve a lawsuit about poll-watchers for the November election.",
      "As part of the settlement agreement, which was obtained by CNN, Detroit election officials reaffirmed their commitment under state law to hire at least one GOP poll watcher at each voting location and reiterated their goal to have partisan parity for poll watchers, to the extent that enough GOP poll watchers sign up and undertake the necessary training.",
      "Detroit officials also agreed to increase communication with local Republican Party officials and provide them with regular updates about the number of GOP poll watchers applied and completed the training.",
      "Republicans filed the lawsuit in August and asked a state judge to force election officials in Detroit to ensure there is parity between Democratic and Republican poll watchers.",
      "The lawsuit alleged that during the 2024 primaries, there were some voting precincts in Detroit with massively lopsided numbers of poll watchers, favoring Democrats. They claimed there were about 200 of the city’s 335 precincts didn’t have any GOP poll watchers whatsoever. (Detroit, which is in Wayne County, is a Democratic stronghold.)",
      "Detroit saw some of the most chaotic moments in the post-election process in 2020.",
      "Supporters of then-President Donald Trump flooded some of the areas near the massive vote-counting center in downtown Detroit, forcing officials to board up some of the windows out of fears that the protesters would disrupt the process. The incident sparked backlash in right-wing media and on social media. Federal prosecutors recently said there were efforts by Trump campaign officials to gin up the chaos in Detroit.",
      "After he lost the 2020 election, Trump peddled baseless claims that GOP poll watchers were systematically sidelined in Detroit and other cities. Those allegations were false."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27k5eu6000w3d5vq75tf0z0\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ERepublican%20Party%20and%20Detroit%20officials%20settle%20poll-watcher%20lawsuit%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27k5eu6000w3d5vq75tf0z0",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27k5eu6000w3d5vq75tf0z0"
    },
    "completed": false
  },
  {
    "title": "Trump takes aim at Schiff in deeply personal attack during California rally",
    "slug": "trump-takes-aim-at-schiff-in-deeply-personal-attack-during-california-rally",
    "published_by": "From CNN's Arit John",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24283085091703.jpg?c=original",
    "metadata": "Rep. Adam Schiff talks to the media on October 8, in Glendale, California.",
    "contents": [
      "Former President Donald Trump launched into a deeply personal attack on Democratic Rep. Adam Schiff during his campaign rally in Coachella, California, on Saturday, calling the Democratic Senate nominee names and mocking his physical appearance.",
      "The comments followed an extended riff in which Trump defended his praise of Chinese President Xi Jinping, who he called a “brilliant” leader who rules “with an iron fist.”",
      "The former president suggested, without evidence, that Schiff would win because of voter fraud and called the California Democrat a “low life,” a “sick puppy” and “one of the least attractive human beings I think I’ve ever seen.”",
      "Schiff brushed off the comments in a social media post.",
      "The animosity between the former president and the California Democrat dates back to the early days of Trump’s term in office. Schiff has been one of Trump’s most vocal critics in Congress, and led the House Intelligence Committee’s investigation into the Trump campaign’s alleged ties to Russia. Schiff also served as the House impeachment manager during the former president’s first trial."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27kdcrq00143d5vdhp0168n\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20takes%20aim%20at%20Schiff%20in%20deeply%20personal%20attack%20during%20California%20rally%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27kdcrq00143d5vdhp0168n",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27kdcrq00143d5vdhp0168n"
    },
    "completed": false
  },
  {
    "title": "Trump repeats threat to withhold funds for fighting California fires if reelected",
    "slug": "trump-repeats-threat-to-withhold-funds-for-fighting-california-fires-if-reelected",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/2024-09-12t061407z-1924010167-rc2ly9abge0v-rtrmadp-3-usa-wildfires.jpg?c=original",
    "metadata": "The Bridge Fire burns in Wrightwood, California, on September 11.",
    "contents": [
      "Former President Donald Trump on Saturday again threatened to withhold federal funds used to fight fires in California if reelected as he attacked Democratic Gov. Gavin Newsom over water rules in the state.",
      "Trump argued Newsom had “mismanaged” the water situation in California with environmental regulations that he said came at the expense of farmers.",
      "The former president made the same threat to withhold disaster relief funds a month ago during a news conference at his golf club in Los Angeles.",
      "California Rep. Adam Schiff slammed Trump’s comments in a post on X. “Another reminder that Trump doesn’t care about you, your family, or your communities,” the California Democratic Senate nominee wrote. “He’ll happily let them burn to further his personal politics. We’re all Americans, Donald. And when disaster hits, we stand together.”"
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27kvod1001m3d5v3uyhzb6n\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=%3Cstrong%3ETrump%20repeats%20threat%20to%20withhold%20funds%20for%20fighting%20California%20fires%20if%20reelected%3C%2Fstrong%3E\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27kvod1001m3d5v3uyhzb6n",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27kvod1001m3d5v3uyhzb6n"
    },
    "completed": false
  },
  {
    "title": "Obama’s reemergence on the campaign trail for Harris comes as he recognizes his own legacy is at stake",
    "slug": "obamas-reemergence-on-the-campaign-trail-for-harris-comes-as-he-recognizes-his-own-legacy-is-at-stake",
    "published_by": "From CNN's Edward-Isaac Dovere",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177116799-copy.jpg?c=original",
    "metadata": "Former president Barack Obama speaks at a campaign event for  Vice President Kamala Harris on October 10 in Pittsburgh.",
    "contents": [
      "America and the world have a lot riding on who wins in November. So does Barack Obama.",
      "And that’s part of what is powering what people familiar with Obama’s plans told CNN will be the most active closing weeks of an election the former president’s had since his own last campaign. More rallies are coming every week. This past Wednesday alone, he recorded 21 videos for the Harris campaign. More ads for Democratic Senate candidates are already in the can. Content with influencers will keep popping online. He’ll even be doing a few interviews of his own.",
      "This is on top of a range of meetings and phone calls Obama has held over the last year with Kamala Harris, Joe Biden and other top Democrats, first reported by CNN, as advisers, friends and political allies say the former president has become increasingly alarmed by Donald Trump’s continued hold on the country and its politics.",
      "Obama no longer thinks he can get to the people locked in with Trump.",
      "He’s just hoping to help find enough votes in enough states to counter them.",
      "If the vice president wins, Obama will feel vindicated, and in many ways, will be released to more of the post-presidency he’d been hoping for since right before he called to congratulate Trump on election night 2016 — the first time (and ultimately one of the few times) the two spoke.",
      "But a thought has circulated among several people close to the former president, they told CNN: If Trump wins, Obama might be seen as the aberration in the history of American politics, rather than Trump and his nativist authoritarianism. Obama acolytes have spent the last eight years rationalizing Trump as the last gasp backlash to the Democrat and his presidency.",
      "Read more here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27jahkh00053d5v2o477fzh\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Obama%E2%80%99s%20reemergence%20on%20the%20campaign%20trail%20for%20Harris%20comes%20as%20he%20recognizes%20his%20own%20legacy%20is%20at%20stake\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27jahkh00053d5v2o477fzh",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27jahkh00053d5v2o477fzh"
    },
    "completed": false
  },
  {
    "title": "Trump spread conspiracies on mail-in voting for years. Now his campaign is urging people to vote early and by mail",
    "slug": "trump-spread-conspiracies-on-mail-in-voting-for-years-now-his-campaign-is-urging-people-to-vote-early-and-by-mail",
    "published_by": "From CNN's Em Steck, Andrew Kaczynski and Jeremy Herb",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2171843766.jpg?c=original",
    "metadata": "Absentee ballots are prepared to be mailed at the Wake County Board of Elections on September 17, in Raleigh, North Carolina.",
    "contents": [
      "Donald Trump’s campaign is making a last-minute push to advocate for early and mail-in voting, methods the former president has falsely vilified for years as dangerous and fraudulent.",
      "With less than a month to go in a tight race, Trump’s campaign is urging people to vote early and by mail, while also working to expand voting access in North Carolina after Hurricane Helene.",
      "In a series of recent virtual town halls and robocalls reviewed by CNN, Trump and his daughter-in-law Lara Trump, the co-chair of the Republican National Committee, have actively encouraged voters to take advantage of early voting options, including mail-in ballots.",
      "Voting rights advocates, while happy to see the Trump campaign join in a bipartisan push for expanded voting access, note that it cuts against a lengthy record of trying to restrict voting in this election and in 2020, when the pandemic upended voting across the country.",
      "“It’s great that the Trump campaign was speaking with the same voice as so many others and asking for expansions to voting access in the wake of Hurricane Helene,” said Sean Morales-Doyle, the director of the voting rights program at the Brennan Center for Justice. “But it does trouble me that they don’t take a sort of uniform approach to that – or to mail voting or to early voting.”",
      "Read more here."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27j6ytq00003d5vlfscdxcv\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Trump%20spread%20conspiracies%20on%20mail-in%20voting%20for%20years.%20Now%20his%20campaign%20is%20urging%20people%20to%20vote%20early%20and%20by%20mail\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm27j6ytq00003d5vlfscdxcv",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm27j6ytq00003d5vlfscdxcv"
    },
    "completed": false
  },
  {
    "title": "Harris is in \u0026#34;excellent health,\u0026#34; according to detailed letter from her physician",
    "slug": "harris-is-in-34excellent-health34-according-to-detailed-letter-from-her-physician",
    "published_by": "From CNN's Eric Bradner",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177890992.jpg?c=original",
    "metadata": "Democratic presidential nominee Vice President Kamala Harris at a campaign rally in Chandler, Arizona, on October 10.",
    "contents": [
      "Vice President Kamala Harris is in “excellent health,” her doctor, US Army physician Joshua R. Simmons, said in a letter summarizing her medical history that was released by the White House on Saturday.",
      "Harris has seasonal allergies and hives and is nearsighted, Simmons’ letter said. Her immunizations and preventive care recommendations are all up to date, and her most recent April physical exam and her routine bloodwork have shown no cause for alarm.",
      "The vice president wears contact lenses, takes a vitamin D3 supplement, and at times uses over-the-counter and prescription allergy medications, including Allegra, nasal spray and eye drops, Simmons wrote.",
      "“She possesses the physical and mental resiliency required to successfully execute the duties of the Presidency,” Simmons’ letter said.",
      "Dr. Sanjay Gupta, CNN’s chief medical correspondent, said the letter is “most notable in some ways” for what it does not show. “No history of diabetes, high blood pressure, high cholesterol, cardiac disease, lung disease, cancer,” Gupta noted, summarizing it as “basically saying (Harris) is fit for duty.”",
      "The letter is an effort to draw a contrast between the 59-year-old Democratic nominee and her 78-year-old Republican rival, Donald Trump, who is vying to become the oldest person ever elected to the Oval Office and has released relatively little detailed information about his own medical history."
    ],
    "socials": {
      "facebook": "https://www.facebook.com/dialog/share?app_id=80401312489\u0026href=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm26hw1al0020pvqjd9ao08us\u0026display=popup",
      "twitter": "https://twitter.com/intent/tweet?text=Harris%20is%20in%20%22excellent%20health%2C%22%20according%20to%20detailed%20letter%20from%20her%20physician\u0026url=https%3A%2F%2Fwww.cnn.com%2Fpolitics%2Flive-news%2Ftrump-harris-election-10-13-24%23cm26hw1al0020pvqjd9ao08us",
      "website": "https://www.cnn.com/politics/live-news/trump-harris-election-10-13-24#cm26hw1al0020pvqjd9ao08us"
    },
    "completed": false
  }
]