[
  {
    "title": "Vance says “we’re going to support the 2024 result,” adding he thinks Trump will win",
    "slug": "vance-says-were-going-to-support-the-2024-result-adding-he-thinks-trump-will-win",
    "published_by": "From CNN's Kit Maher",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24282696652345.jpg?c=original",
    "metadata": "Republican vice presidential nominee Sen. JD Vance, R-Ohio speaks at a campaign event at Eastern Market in Detroit on October 8.",
    "contents": [
      "Republican vice presidential candidate JD Vance said Tuesday that he would support the 2024 election result and added that he believes that it will result in a Trump victory, while continuing to dodge on questions surrounding the 2020 election.",
      "“We’re going to support the 2024 result. And I think that result is going to be Donald Trump wins not just Michigan but the whole presidency,” Vance said in a pull aside interview with WXYZ.",
      "“Nobody disputes that Joe Biden and Kamala Harris are the president and vice president,” Vance said. “What President Trump and I have said is just that there — there are some issues that are worth debating that happened in 2020.”",
      "Vance repeated that 2020 is in “the past,” when asked about voters who are disappointed by his stance on certifying the election results. Vance has said that he would have asked the states to submit alternative slate of electors if he were in Mike Pence’s shoes.",
      "As one example, Vance said big tech companies were trying to censor Americans in 2020.",
      "Trump has regularly referred to the 2020 election as stolen and rigged. Asked about his 2021 “childless cat ladies” comment, Vance said he made a “dumb comment years ago.”",
      "“I’d ask people, don’t take a comment, a boneheaded comment, I made four years ago in sarcasm and focus on that. Focus on the pro-family agenda that Donald Trump and I have,” he said."
    ]
  },
  {
    "title": "Walz sharply attacks Trump over Woodward reporting on Putin calls and Covid supply shipment",
    "slug": "walz-sharply-attacks-trump-over-woodward-reporting-on-putin-calls-and-covid-supply-shipment",
    "published_by": "From CNN's Aaron Pellish in Reno, Nevada",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24276072807293.jpg?c=original",
    "metadata": "Tim Walz speaks during a debate in New York on October 1.",
    "contents": [
      "Minnesota Gov. Tim Walz sharply attacked former President Donald Trump after reporting shed light on his relationship with Russian President Vladimir Putin, labeling Trump “a risk to our national security” during a rally in Reno, Nevada, on Tuesday.",
      "The Democratic vice presidential nominee referenced new reporting by journalist Bob Woodward that says Trump and Putin have had “maybe as many as seven calls” since Trump left the White House in 2021, attacking Trump for having frequent calls with a “dictator.” The former president denied the reporting in an interview with Newsmax on Tuesday.",
      "The governor also reiterated a line he’d used at fundraisers earlier on Tuesday while attacking Trump for reportedly discretely sending Covid-19 testing supplies to Putin during the pandemic, and recalled his own efforts to manage Minnesota’s response to the pandemic as a point of comparison.",
      "Trump told ABC News earlier Tuesday that report is “false.”"
    ]
  },
  {
    "title": "Trump says Haitian migrants with Temporary Protected Status in Springfield are “illegal immigrants as far as I’m concerned\u0026#34;",
    "slug": "trump-says-haitian-migrants-with-temporary-protected-status-in-springfield-are-illegal-immigrants-as-far-as-im-concerned34",
    "published_by": "From CNN's Kate Sullivan",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2176803036.jpg?c=original",
    "metadata": "Donald Trump listens to a question from the audience during a town hall-style campaign event at the Crown Center Arena in Fayetteville, North Carolina, October 4.",
    "contents": [
      "Former President Donald Trump said Tuesday that Haitian migrants in Springfield, Ohio, who are in the country legally with Temporary Protected Status are “illegal immigrants as far as I’m concerned.”",
      "The comments come after Trump said he would revoke the Temporary Protected Status for the Haitian migrants in the Ohio city. Trump and his allies have amplified false claims about Haitian migrants in Springfield alleging that they are eating people’s pets — rumors decried by state and local officials as untrue and destructive to the community.",
      "“I mean, look at Springfield, where 30,000 illegal immigrants are dropped, and it was, they may have done it through a certain little trick, but they are illegal immigrants as far as I’m concerned. They’re destroying the town, they’re destroying the whole — they’ll end up destroying the state. We cannot let this happen,” Trump said in an interview with Newsmax.",
      "Some context: Many Haitians came into the country under a Biden-Harris administration parole program that gives permission to enter to vetted participants with US sponsors. Many have “Temporary Protected Status,” as CNN has previously reported, which shields them from deportation and allows them to live and work in the country for a limited period of time.",
      "The city of Springfield notes on its website that approximately 12,000 to 15,000 immigrants live in Clark County — which has a population of roughly 136,000 — and that Haitian immigrants are there legally.",
      "Haitian workers play a significant role in Springfield’s economy, filling much-needed jobs, the city has said. Ohio Republican Gov. Mike DeWine has acknowledged the city was having some issues adjusting to the influx of mostly Haitian immigrants, but he said in an interview last month they were working on with the issues and called the Haitian immigrants “positive influences” on the community."
    ]
  },
  {
    "title": "Doug Emhoff campaigns in Arizona, thanks Republicans backing Harris",
    "slug": "doug-emhoff-campaigns-in-arizona-thanks-republicans-backing-harris",
    "published_by": "From CNN's Veronica Stracqualursi in Mesa, Arizona",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/still-21026131-39316-033235847004-still.jpg?c=original",
    "metadata": "Second gentleman Doug Emhoff speaks during a campaign event in Mesa, Arizona, on Tuesday, October 8.",
    "contents": [
      "Second gentleman Doug Emhoff campaigned in battleground Arizona on Tuesday for his wife, Vice President Kamala Harris, thanking Republicans who have chosen to back the Democratic presidential ticket for “putting country over party.”",
      "“Thank you all, Mayor [John Giles] and the other Republicans here for putting country over party. This is the most important election of our lifetimes, but it’s also the most important election of our nation’s lifetime,” he said at a “Republicans for Harris volunteer appreciation event” in Mesa.",
      "He also thanked the Church of Latter-day Saints members, a key voting bloc in Arizona, for “recognizing the values at stake.”",
      "Mesa Mayor John Giles, a self-declared lifelong Republican who has said the Biden-Harris administration delivered results for his conservative community, leads Arizona Republicans for Harris. The church member, who also spoke at the Democratic National Convention, told the room of supporters that this “election is going to be decided by who does the better job of getting out the vote.”"
    ]
  },
  {
    "title": "Ethel Kennedy being treated in hospital after stroke",
    "slug": "ethel-kennedy-being-treated-in-hospital-after-stroke",
    "published_by": "From CNN's Rashard Rose",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-609175458.jpg?c=original",
    "metadata": "Ethel Kennedy attends a ceremony at the John F. Kennedy Presidential Library in Boston on September 20, 2016.",
    "contents": [
      "Ethel Kennedy, the widow of Robert F. Kennedy and mother of former presidential candidate Robert F. Kennedy Jr., is receiving hospital treatment after suffering a stroke last week, her grandson said Tuesday.",
      "“I wanted to let you know about my incredible grandmother, Ethel Kennedy. She has had a great summer and transition into fall. Every day she enjoyed time with her children, nieces, nephews, grandchildren, and great-grandchildren. She was able to get out on the water, visit the pier, and enjoy many lunches and dinners with family. It has been a gift to all of us and to her as well. Unfortunately, on Thursday morning she suffered a stroke in her sleep,” Joe Kennedy III said in a post on X.",
      "“She was brought to an area hospital, where she is now receiving treatment. She is comfortable, she is getting the best care possible, and she is surrounded by family,” the former congressman continued.",
      "Ethel shared 11 children with Robert F. Kennedy, who she married in 1950. The former New York senator and US attorney general was assassinated in 1968 while a presidential candidate.",
      "An environmental and human rights activist, Kennedy, 96, helped found the Robert F. Kennedy Human Rights, which supports the causes championed by Robert F. Kennedy. In 2014, she received the Presidential Medal of Freedom from President Barack Obama.",
      "Kennedy’s grandson on Tuesday asked for thoughts, prayers and his family’s privacy."
    ]
  },
  {
    "title": "Biden on Woodward reporting that Trump shipped Putin Covid supplies: \u0026#34;What the hell\u0026#39;s wrong with this guy?\u0026#34;",
    "slug": "biden-on-woodward-reporting-that-trump-shipped-putin-covid-supplies-34what-the-hell39s-wrong-with-this-guy34",
    "published_by": "From CNN's DJ Judd",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24282791901022.jpg?c=original",
    "metadata": "President Joe Biden walks down the steps of Air Force One at Philadelphia International Airport in Philadelphia, Tuesday, October 8, to attend a campaign event for Sen. Bob Casey.",
    "contents": [
      "President Joe Biden blasted former President Donald Trump following new reporting that Trump secretly shipped Russian President Vladimir Putin Covid-19 testing equipment for his personal use during the height of the pandemic, according to reporters in the room during Biden’s remarks at a Philadelphia fundraiser Tuesday.",
      "“He called his good friend Putin, not a joke, and made sure he had the tests. He had the tests. What the hell’s wrong with this guy?” Biden said.",
      "Earlier Tuesday, CNN reported on excerpts from journalist Bob Woodward’s upcoming book, “War,” which details the close ties between Trump and Putin, including the revelation that there have been “maybe as many as seven” calls between the two leaders since Trump left the White House in 2021.",
      "Pennsylvania Senate race: Biden was speaking at a fundraiser for Pennsylvania Democratic Sen. Bob Casey, who faces Republican Dave McCormick in November. According to pool reporters in the room, Biden said McCormick “is in lockstep with Donald Trump, voted by historians as the most dishonorable president in American history.”",
      "In his remarks Tuesday, the president painted the race for Pennsylvania’s Senate seat as a battle of “Scranton values versus Mar-a-Lago values,” a line he used repeatedly when still running for reelection.",
      "And he called Casey, whose family he said he knew growing up in Scranton, “a man of character” who “keeps his word.”"
    ]
  },
  {
    "title": "Romney walks up to the line of saying he\u0026#39;ll vote for Harris",
    "slug": "romney-walks-up-to-the-line-of-saying-he39ll-vote-for-harris",
    "published_by": "From CNN's Morgan Rimmer",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/still-21025425-923282-still.jpg?c=original",
    "metadata": "Sen. Mitt Romney participates in an event at University of Utah's Hinckley Institute of Politics on Tuesday, October 8.",
    "contents": [
      "Republican Sen. Mitt Romney, a strong critic of former President Donald Trump, walked right up to the line of committing to vote for Vice President Kamala Harris during an event on Tuesday. However, he said he would not go any further because he worries it would hurt his position in a future, non-Trumpian Republican Party.",
      "“My own view is that I want to continue to have a voice in the Republican Party, following this election — because I think there is a good shot that the Republican Party is going to have to be rebuilt or reoriented, either after this election, or, if Donald Trump is reelected, after he’s the president — and believe I will have more influence in the party by virtue of saying it as I’ve said it.”",
      "The Utah senator, who is not running for reelection, added that since he voted to convict Trump in both of the former president’s impeachment trials, “I think where I stand on Donald Trump is pretty clear.”",
      "Romney noted he believes that Trump will win the White House, in part due to Democrats playing to their base on social issues.",
      "“I think the reason the Democratic Party is in trouble this year — in my opinion, will likely lose the presidential race … is not because of their policy, but it’s because of the positions they’ve taken on cultural issues,” he said."
    ]
  },
  {
    "title": "Vance identifies China as bigger threat to US than Iran",
    "slug": "vance-identifies-china-as-bigger-threat-to-us-than-iran",
    "published_by": "From CNN's Kit Maher",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/ap24282667765702.jpg?c=original",
    "metadata": "Sen. JD Vance speaks at a campaign event at Eastern Market Tuesday, October 8, in Detroit.",
    "contents": [
      "Republican vice presidential candidate JD Vance said he believes China is the biggest threat to the United States, after Harris identified Iran as the greatest adversary of the United States in an interview with 60 Minutes.",
      "“I think, man, it revealed that Kamala Harris seems to be totally fine with starting or escalating a conflict in every continent, all over the world. Donald Trump believes peace through strength. Stop the killing, get Americans out of harm’s way, and focus on building a peaceful globe. That is how you help Palestinians. That’s how you help Israelis. But most importantly, it’s how you help American citizens, is peace,” Vance said.",
      "Vance said his pitch to Arab American voters on why they should vote for Donald Trump is that he will bring “peace” to the Middle East region.",
      "“Arab Americans often have different views than Jewish Americans on what’s going on in Israel, what’s going on in Palestine. But I think both Jewish Americans and Arab Americans recognize that what’s in the best interest of Israel and Palestine is peace. And Donald J. Trump was the president of peace,” Vance said.",
      "The reporter who asked the question about Arab Americans mentioned how Trump falsely said that he had visited Gaza, but Vance did not address that.",
      "Vance also said that the Trump campaign is “thrilled” to have the support of Hamtramck Mayor Amer Ghalib, who the Detroit News notes is the first Arab American and first Muslim to lead the city, which has a large Muslim population.",
      "“I’m not meeting any Arab American or Muslim American leaders on this particular trip, though, we certainly will in future trips to Michigan,” Vance said."
    ]
  },
  {
    "title": "Vance engages in traveling press tradition and answers question on an orange",
    "slug": "vance-engages-in-traveling-press-tradition-and-answers-question-on-an-orange",
    "published_by": "From CNN's Kit Maher",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/orange.jpg?c=original",
    "metadata": "A question written on an orange was rolled to Sen. JD Vance on his campaign plane on Tuesday, Octoaber 8.",
    "contents": [
      "A traveling press tradition played out on Sen. JD Vance’s campaign plane this afternoon, as the network reporters covering the campaign and one print reporter rolled an orange with a question to the front of the plane where Vance was seated.",
      "While CNN’s attempt to send the orange forward slightly dented the fruit, ABC effectively bowled the orange up toward Vance’s seat.",
      "Within minutes, Vance returned the orange with an answer to his favorite song: “Ten Years Gone” by Led Zeppelin.",
      "Yesterday, the reporters covering Walz asked the vice presidential nominee who his dream dinner guest is on their own orange and he replied Bruce Springsteen."
    ]
  },
  {
    "title": "Harris deflects when asked if she would appoint Liz Cheney as a Cabinet member",
    "slug": "harris-deflects-when-asked-if-she-would-appoint-liz-cheney-as-a-cabinet-member",
    "published_by": "From CNN's Ebony Davis",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-ap24277851325056.jpg?c=original",
    "metadata": "Vice President Kamala Harris, right, and former Congresswoman Liz Cheney greet attendees during a campaign event at Ripon College in Ripon, Wisconsin, on Thursday, October 3.",
    "contents": [
      "Vice President Kamala Harris on Tuesday deflected on whether she would appoint Republican former Rep. Liz Cheney as a Cabinet member if she is elected, saying she has to first win November’s election before making a decision.",
      "“She has shown extraordinary courage this moment where there’s such violent, divisive language that she would put herself out so publicly and say … country before party. And you know, she and I don’t agree on everything, but the fundamentals, we do agree on,” Harris added.",
      "Cheney appeared on the campaign trail with Harris for the first time last week in Ripon, Wisconsin, where she said she has “never voted for a Democrat, but would be “proudly casting” her vote for Harris.",
      "Earlier today, Harris suggested that she will have a Republican in her cabinet.",
      "“Listen, I plan on having a Republican in my cabinet,” Harris said during an interview on The View."
    ]
  },
  {
    "title": "CNN issues deadline for Trump and Harris to agree to final 2024 debate",
    "slug": "cnn-issues-deadline-for-trump-and-harris-to-agree-to-final-2024-debate",
    "published_by": "From CNN's Brian Stelter",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/wnl-8632.jpg?c=original",
    "metadata": "Banners hang outside of CNN’s Atlanta headquarters ahead of a CNN Presidential Debate on Monday, June 24.",
    "contents": [
      "The window for a final presidential debate between former President Donald Trump and Vice President Kamala Harris is closing.",
      "CNN has publicly offered to host a debate in Atlanta on October 23. Harris has accepted the invitation and welcomed the chance to debate Trump again, but Trump has rejected her calls.",
      "On Tuesday, CNN stepped up the pressure by writing to both campaigns and setting a Thursday deadline for a formal response. Debates, after all, can’t be produced overnight; the events take time to organize.",
      "“With less than 30 days to Election Day, we are placing a deadline for a formal response from both campaigns for this Thursday, October 10 at 12 p.m. ET to participate,” the network said.",
      "What both campaigns have said: The Harris campaign quickly accepted the second debate invitation, adding that “Trump should have no problem agreeing” since “it is the same format and setup as the CNN debate he attended and said he won in June, when he praised CNN’s moderators, rules, and ratings.”",
      "But Trump shunned the offer, claiming it was “too late” for a second debate. (In fact, the CNN date is in line with final debates of other recent election cycles.)",
      "Last week, the Harris campaign said “she will be in Atlanta on October 23,” so “Donald Trump should step up and face the voters.” But Trump responded on Truth Social, “I beat Biden, I then beat her, and I’m not looking to do it again, too far down the line.”"
    ]
  },
  {
    "title": "How some states impacted by Hurricane Helene are preparing for voting",
    "slug": "how-some-states-impacted-by-hurricane-helene-are-preparing-for-voting",
    "published_by": "From CNN's Curt Devine and Devan Cole",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2175646439.jpg?c=original",
    "metadata": "A Supervisor and Elections office staff member runs sample voting ballots through voting machines during a test run at the Supervisor of Elections Office in Tampa, Florida, on October 3.",
    "contents": [
      "Hurricane Helene disrupted elections infrastructure and postal service in several states, with less than one month to go until Election Day. It comes as Hurricane Milton is expected to make landfall in Florida later this week.",
      "CNN previously reported that in the aftermath of Hurricane Helene, which had a devastating impact on parts of Florida, Georgia and North Carolina, election officials in those places have begun to work quickly to ensure voters can still securely cast early ballots.",
      "Here’s how some states are preparing:",
      "North Carolina’s election board unanimously passed a resolution Monday to grant the counties most affected by Hurricane Helene the ability to add or remove early voting sites and adjust the schedules for those sites. It also permits displaced voters to drop off absentee ballots at other county boards of election where they have relocated and further empowers “multipartisan assistance teams” to help voters with absentee ballots, among other measures, according to the election board’s general counsel Paul Cox.",
      "Still, Karen Bell, the executive director of the elections board, said all county offices are open in North Carolina. Bell said the state remains committed to open early voting on October 17, as planned.",
      "Officials in Buncombe County, North Carolina, in the Asheville area that was devastated by the storm, also reaffirmed that they are prepared to move forward with voting in the 2024 election.",
      "CNN’s Paula Reid showed how Wake County, North Carolina, is counting absentee and mail-in ballots:",
      "Florida is not planning to extend its voter registration deadline, Republican Gov. Ron DeSantis said Monday, rejecting calls from voting rights groups to provide more time to residents in the storm-battered state.",
      "Voting rights groups have for days been calling for the governor to extend Monday’s deadline until October 15. A letter sent by more than two dozen organizations to DeSantis last week with that demand was sent again to him Monday, according to the League of Women Voters of Florida, one of the groups behind the push.",
      "Visit CNN’s voter handbook to see how to vote in your area."
    ]
  },
  {
    "title": "Here\u0026#39;s what is on the candidates\u0026#39; schedules today",
    "slug": "here39s-what-is-on-the-candidates39-schedules-today",
    "published_by": "From CNN staff",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2176596602.jpg?c=original",
    "metadata": "Former President Donald Trump speaks at Trump National Doral golf club in Miami, on October 7.",
    "contents": [
      "It is a busy day on the campaign trail as the 2024 candidates continue to make their pitches to voters with less than a month until Election Day.",
      "Former President Donald Trump will appear before a virtual town hall about health care and chronic disease later tonight at 8 p.m. ET.",
      "At the town hall, he will be joined by Robert F. Kennedy Jr. and Tulsi Gabbard, along with several doctors. The event is focused on “America’s health crisis and how we can solve the chronic disease epidemic,” according to a posting of the event on Gabbard’s website.",
      "Vice President Kamala Harris will participate in media interviews in New York all day. At 11 a.m. ET, the vice president will participate in a live interview on ABC’s “The View,” and at 1 p.m. ET, she will be interviewed by Howard Stern on his SiriusXM show. Harris will then record an interview on “The Late Show with Stephen Colbert” which will air in the evening. Yesterday, CBS aired Harris’ “60 Minutes” interview. Read takeaways from it here.",
      "The running mates are also on the campaign trail on Tuesday. Democrat Tim Walz will be in Seattle, Washington, before speaking at a fundraiser in Sacramento, California. Walz will then travel to Nevada and deliver remarks in Reno.",
      "Republican JD Vance is expected to hold a rally in Detroit, Michigan. Vance will then travel to Denver, Colorado, and participate in a closed-press evening fundraiser.",
      "Both running mates will then head to Arizona and stay there overnight."
    ]
  },
  {
    "title": "Walz says his dream dinner guest would be Bruce Springsteen",
    "slug": "walz-says-his-dream-dinner-guest-would-be-bruce-springsteen",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2170281264.jpg?c=original",
    "metadata": "Bruce Springsteen at the Roy Thomson theatre in Toronto, Ontario, Canada, on September 8.",
    "contents": [
      "Minnesota Gov. Tim Walz told reporters traveling with him on a trip along the West Coast that his dream dinner guest would be Bruce Springsteen.",
      "Reporters travelling on Walz’s plane during a swing that will see the Democratic vice-presidential candidate in California, Washington, Nevada and Arizona participated in the time-honored campaign tradition of writing a question on an orange and rolling it to the front of the plane for the candidate to answer. Reporters wrote asking who Walz’s dream dinner guest would be and attempted to roll an orange to the front of the plane on Sunday, according to pool reports.",
      "Reporters traveling with Walz confirmed he was aware of the question written on the orange but did not receive a response on Sunday.",
      "On Monday evening, a campaign official returned the orange to reporters with “Bruce Springsteen” written in response, according to pool reports.",
      "In an appearance on “Jimmy Kimmel Live” on Monday, Walz discussed his love of Springsteen’s music following the musician’s endorsement of his and Vice President Kamala Harris’ campaign.",
      "“This is– a high school kid, and– got The River,” he said, referring to Springsteen’s fifth studio album. “Changed my life, it was a religious experience.”"
    ]
  },
  {
    "title": "Walz jokes about having \u0026#34;a problem about not being specific with my language\u0026#34; in Kimmel appearance",
    "slug": "walz-jokes-about-having-34a-problem-about-not-being-specific-with-my-language34-in-kimmel-appearance",
    "published_by": "From CNN's Aaron Pellish",
    "thumb": "https://media.cnn.com/api/v1/images/stellar/prod/walz-kimmel-intv-1.jpg?c=original",
    "metadata": "Minnesota Gov. Tim Walz talks to Jimmy Kimmel on Monday.",
    "contents": [
      "Minnesota Gov. Tim Walz joked about having “a problem about not being specific with my language” during an appearance on “Jimmy Kimmel Live” on Monday.",
      "Walz and Kimmel discussed the moment when Walz asked Vance during the debate about the 2020 election and Vance declined to directly answer, which Kimmel joked could have been motivated by seeing former Vice President Mike Pence pushed aside after resisting Trump’s efforts to overthrow the results of the 2020 election.",
      "Walz then said he’s looking forward to defeating Trump while making a comment that appeared to confuse Kimmel to some extent.",
      "“Look, we get to turn the page on that and– and I plan on waking up on November 6th with Madam President,” Walz said, prompting cheers from the studio audience.",
      "“I want to be clear, you won’t be waking up together,” Kimmel replied. “Unless you guys have gotten closer than we thought.”",
      "“I have a problem about not being specific with my language, so thank you for that,” Walz said, again prompting laughs from Kimmel and the crowd.",
      "Some context: The exchange comes the same day Walz said in an interview with “60 Minutes” released Monday that Vice President Kamala Harris told him to “be a little more careful” with how he speaks when asked about disagreements between the two of them.",
      "Since joining the campaign, Walz has faced scrutiny for misleading statements about his military rank when he retired from the National Guard, falsely saying he carried assault weapons “in war,” wrongly suggesting his children were conceived through in vitro fertilization, and saying repeatedly he was in China during the 1989 pro-democracy protests in Tiananmen Square – a false claim he repeated during last week’s vice-presidential debate.",
      "Walz in the interview reiterated his calls for stronger gun restrictions nationally to prevent school shootings, while calling the proposal from some Republicans to arm teachers a “very, very bad idea.”"
    ]
  }
]